--------------------------------------------------------------------------------
      name:  redi15_REDI_state_regressions
       log:  /Users/mollymking/Documents/SocResearch/Dissertation/redi/redi15_RE
> DI_state_regressions.log
  log type:  text
 opened on:   9 Nov 2021, 21:12:58

. 
. //      project:        REDI Methods Paper
. 
. //  task:       Example of REDI regressed on data from a single state in 2019
. //  data:       CPS ASEC from IPUMS, available: https://cps.ipums.org/
. //                              ACS from IPUMS, available: https://usa.ipums.o
> rg/
. 
. //  github:     redi
. //  OSF:                https://osf.io/qmhe8/
. 
. //  author:     Molly King
. 
. display "$S_DATE  $S_TIME"
 9 Nov 2021  21:12:58

. 
. ***--------------------------***
. // # PROGRAM SETUP
. ***--------------------------***
. 
. version 16 // keeps program consistent for future replications

. set linesize 80

. clear all

. set more off

. set seed 1

. 
. ***--------------------------***
. // #  REGRESSION: Income as IV: Predict Migration on 2019  Wyoming  DATA
. ***--------------------------***
. 
. use $deriv/redi14_REDI_Wy2019.dta, clear
(Wyoming 2019 ACS data converted to continuous REDI-calculated values)

. 
. // REDI Income as IV (redi_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ln(REDI-created income), "
>  ///
>                   "gender, race/ethnicity, education, marriage, disability"
WYOMING: Predict migration as function of ln(REDI-created income), gender, race/
> ethnicity, education, marriage, disability

. svy: logistic migrate ///
>         redi_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability   // labor ownhouse
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,694
                                                Population size   =    452,157
                                                Replications      =         80
                                                Design df         =         79
                                                F(  12,     68)   =       6.74
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
redi_hinc_ln |   .8304723   .0307001    -5.03   0.000     .7715593    .8938837
      dB_fem |   1.058523   .0923869     0.65   0.517     .8897184    1.259354
   dB_rblack |   4.347102   2.228239     2.87   0.005     1.567127    12.05856
   dB_rasian |   3.207769   1.922537     1.94   0.055     .9729955    10.57537
    dB_rhisp |   2.064265   .4407147     3.39   0.001     1.349614    3.157339
   dB_rother |   1.206139   .2895548     0.78   0.437     .7479507     1.94501
   dB_edu_HS |    2.24524   .5728995     3.17   0.002     1.351109    3.731086
 dB_edu_sCol |   2.395293   .6933071     3.02   0.003     1.346325    4.261549
  dB_edu_col |   1.957533   .5640522     2.33   0.022     1.103126    3.473707
 dB_edu_grad |   2.320433   .7371252     2.65   0.010     1.233004    4.366904
     married |   .4575338   .0694223    -5.15   0.000     .3382674    .6188511
  disability |   .7839209   .2373985    -0.80   0.424     .4290315     1.43237
       _cons |   .8664818    .391114    -0.32   0.752     .3528307    2.127906
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. // Original ACS Continuous Income as IV (acs_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ln(ACS HH income), " ///
>                   "gender, race/ethnicity, education, marriage, disability"
WYOMING: Predict migration as function of ln(ACS HH income), gender, race/ethnic
> ity, education, marriage, disability

. svy: logistic migrate ///
>         acs_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability //  labor  ownhouse
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,693
                                                Population size   =    451,787
                                                Replications      =         80
                                                Design df         =         79
                                                F(  12,     68)   =       6.31
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 acs_hinc_ln |    .847445   .0393859    -3.56   0.001     .7725661    .9295813
      dB_fem |   1.074697   .0933112     0.83   0.409     .9041286    1.277443
   dB_rblack |   4.206285   2.155971     2.80   0.006     1.516425    11.66746
   dB_rasian |   3.222012   1.919265     1.96   0.053     .9844708    10.54512
    dB_rhisp |   1.968983   .4161953     3.21   0.002     1.292766    2.998913
   dB_rother |   1.165744   .2950905     0.61   0.546     .7043409    1.929405
   dB_edu_HS |    2.23777   .5657087     3.19   0.002     1.352959    3.701233
 dB_edu_sCol |   2.416141   .6912803     3.08   0.003     1.367091    4.270188
  dB_edu_col |   2.005462   .5716729     2.44   0.017       1.1371    3.536962
 dB_edu_grad |   2.242088   .7113141     2.54   0.013     1.192351    4.216006
     married |   .4495843   .0684513    -5.25   0.000     .3320443    .6087323
  disability |   .7650869   .2306425    -0.89   0.377      .419872    1.394134
       _cons |   .7059218   .3940363    -0.62   0.534     .2324003    2.144256
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
. // Artificial ACS categorical Income as IV (acs_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ACS HH income category, " 
> ///
>                   "gender, race/ethnicity, education, marriage, disability"
WYOMING: Predict migration as function of ACS HH income category, gender, race/e
> thnicity, education, marriage, disability

. fvset base 1 acs_hinc

. svy: logistic migrate ///
>         i.acs_hinc /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability //  labor  ownhouse
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,694
                                                Population size   =    452,157
                                                Replications      =         80
                                                Design df         =         79
                                                F(  19,     61)   =       3.69
                                                Prob > F          =     0.0001

-------------------------------------------------------------------------------
              |                BRR *
      migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     acs_hinc |
15000 to l..  |   .8156415   .2713891    -0.61   0.542     .4206035    1.581706
25000 to l..  |   1.297266   .3843589     0.88   0.382     .7192984     2.33964
35000 to l..  |   .8338917   .2111729    -0.72   0.475      .503733    1.380444
50000 to l..  |   .5111725   .1337018    -2.57   0.012     .3037141    .8603399
75000 to l..  |   .3650237   .1176133    -3.13   0.002      .192217    .6931868
100000 to ..  |   .4195809   .1193517    -3.05   0.003     .2381888    .7391115
150000 to ..  |   .3125431   .1044641    -3.48   0.001     .1606867    .6079111
200000 or ..  |   .4748709   .1672412    -2.11   0.038     .2355779    .9572308
              |
       dB_fem |   1.024625   .0887348     0.28   0.780     .8623872    1.217384
    dB_rblack |   3.836006   2.156219     2.39   0.019     1.253074    11.74308
    dB_rasian |   2.956735   1.919145     1.67   0.099     .8123146    10.76219
     dB_rhisp |   2.057348   .4547104     3.26   0.002     1.325106    3.194219
    dB_rother |   1.229464   .2883597     0.88   0.381     .7708482    1.960933
    dB_edu_HS |   2.130565   .5435816     2.96   0.004      1.28217    3.540333
  dB_edu_sCol |   2.261716   .6616868     2.79   0.007      1.26339    4.048916
   dB_edu_col |   1.947047   .5767535     2.25   0.027     1.079722    3.511082
  dB_edu_grad |   2.304576   .7510408     2.56   0.012     1.204695    4.408642
      married |    .508104   .0802696    -4.29   0.000     .3710131    .6958505
   disability |   .7118981   .2250018    -1.08   0.286     .3794926    1.335464
        _cons |   .2024151   .0603152    -5.36   0.000     .1118558    .3662918
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
.         
.         
. ***------------
. // In both models, significance disappears when add home ownership:
. // REDI Income as IV (redi_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ln(REDI-created income), "
>  ///
>                   "add home ownership"
WYOMING: Predict migration as function of ln(REDI-created income), add home owne
> rship

. svy: logistic migrate ///
>         redi_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability ownhouse //
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,694
                                                Population size   =    452,157
                                                Replications      =         80
                                                Design df         =         79
                                                F(  13,     67)   =      14.62
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
redi_hinc_ln |   .9159679    .035556    -2.26   0.026     .8478604    .9895464
      dB_fem |   1.090879   .0982162     0.97   0.337     .9119005    1.304986
   dB_rblack |   2.895166   1.649036     1.87   0.066     .9317572     8.99589
   dB_rasian |   2.746603    1.87635     1.48   0.143     .7050991    10.69896
    dB_rhisp |   1.726011   .3684677     2.56   0.012     1.128504    2.639879
   dB_rother |    1.13929   .2830918     0.52   0.601      .694764    1.868235
   dB_edu_HS |   1.944482   .5636329     2.29   0.024      1.09203    3.462369
 dB_edu_sCol |   2.145725   .6926541     2.37   0.020     1.128566    4.079637
  dB_edu_col |   1.836479   .6038095     1.85   0.068     .9544854    3.533481
 dB_edu_grad |   2.115499    .757265     2.09   0.040     1.037473    4.313688
     married |   .6181352   .1049046    -2.83   0.006     .4409383    .8665409
  disability |   .7291866   .2001643    -1.15   0.253     .4222273    1.259305
    ownhouse |   .2297209   .0374528    -9.02   0.000     .1660601    .3177868
       _cons |   .7332833   .3317961    -0.69   0.495     .2979402    1.804739
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
. 
. // Original ACS Contnuous Income as IV (acs_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ln(ACS HH income), " ///
>                   "add home ownership"
WYOMING: Predict migration as function of ln(ACS HH income), add home ownership

. svy: logistic migrate ///
>         acs_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability ownhouse //  
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,693
                                                Population size   =    451,787
                                                Replications      =         80
                                                Design df         =         79
                                                F(  13,     67)   =      13.81
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 acs_hinc_ln |   .9415949   .0538024    -1.05   0.295     .8403693    1.055013
      dB_fem |    1.10063   .0991875     1.06   0.291     .9198961    1.316872
   dB_rblack |   2.856194   1.627302     1.84   0.069      .918918    8.877664
   dB_rasian |   2.735534   1.865354     1.48   0.144     .7040144    10.62925
    dB_rhisp |     1.6879   .3564116     2.48   0.015       1.1087    2.569683
   dB_rother |   1.124895   .2866776     0.46   0.645     .6773463    1.868158
   dB_edu_HS |   1.951373   .5612736     2.32   0.023     1.100781    3.459232
 dB_edu_sCol |   2.158942    .691347     2.40   0.019     1.141367    4.083727
  dB_edu_col |   1.861774   .6087661     1.90   0.061     .9711142    3.569304
 dB_edu_grad |   2.076299   .7419169     2.04   0.044     1.019534    4.228417
     married |   .6077125   .1043204    -2.90   0.005     .4318246    .8552418
  disability |    .725446   .1993933    -1.17   0.246     .4197667    1.253725
    ownhouse |   .2260492   .0366903    -9.16   0.000     .1636419    .3122563
       _cons |   .5525365   .3570026    -0.92   0.361     .1526974    1.999357
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
. 
. // Artificial ACS categorical Income as IV (acs_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ACS HH income category, " 
> ///
>                   "add home ownership"
WYOMING: Predict migration as function of ACS HH income category, add home owner
> ship

. svy: logistic migrate ///
>         i.acs_hinc /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability  ownhouse //  labor  ownhouse
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,694
                                                Population size   =    452,157
                                                Replications      =         80
                                                Design df         =         79
                                                F(  20,     60)   =       9.25
                                                Prob > F          =     0.0000

-------------------------------------------------------------------------------
              |                BRR *
      migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     acs_hinc |
15000 to l..  |   .8635408   .2970461    -0.43   0.671     .4354386    1.712533
25000 to l..  |   1.732434   .5480432     1.74   0.086     .9229897    3.251747
35000 to l..  |   1.185715   .3087184     0.65   0.515     .7061714    1.990904
50000 to l..  |   .7789933   .2171462    -0.90   0.373     .4472688    1.356747
75000 to l..  |   .6227757   .2094831    -1.41   0.163     .3188302    1.216477
100000 to ..  |   .7605474    .237457    -0.88   0.383     .4085373    1.415862
150000 to ..  |   .7158015   .2708356    -0.88   0.380     .3370672    1.520088
200000 or ..  |   1.019217   .3393067     0.06   0.955      .525395    1.977184
              |
       dB_fem |   1.066921   .0975939     0.71   0.481     .8893232    1.279985
    dB_rblack |    2.74532   1.745624     1.59   0.116     .7743439    9.733119
    dB_rasian |   2.590258   1.839708     1.34   0.184     .6300589     10.6489
     dB_rhisp |    1.72995    .378913     2.50   0.014      1.11865    2.675305
    dB_rother |   1.159335   .2913774     0.59   0.558     .7029878    1.911923
    dB_edu_HS |    1.94429    .562407     2.30   0.024     1.093231    3.457882
  dB_edu_sCol |   2.130735   .6879911     2.34   0.022     1.120497    4.051801
   dB_edu_col |   1.865688   .6222916     1.87   0.065     .9605245    3.623844
  dB_edu_grad |   2.104413   .7649992     2.05   0.044     1.020676    4.338844
      married |   .6446319   .1120907    -2.53   0.014     .4560368     .911221
   disability |   .7236832   .2074586    -1.13   0.263     .4090145    1.280437
     ownhouse |   .2329996   .0380795    -8.91   0.000     .1682977    .3225763
        _cons |   .3168763   .1063244    -3.43   0.001     .1624935    .6179362
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. ***--------------------------***
. // #  REGRESSION: Income as IV: Predict Migration on 2019  California  DATA
. ***--------------------------***
. 
. use $deriv/redi14_REDI_Ca2019.dta, clear
(California 2019 ACS data converted to continuous REDI-calculated values)

. 
. // REDI Income as IV (redi_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ln(REDI-created income), "
>  ///
>                   "gender, race/ethnicity, education, marriage, disability"
CALIFORNIA: Predict migration as function of ln(REDI-created income), gender, ra
> ce/ethnicity, education, marriage, disability

. svy: logistic migrate ///
>         redi_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability 
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,154
                                               Population size   =  31,298,289
                                               Replications      =          80
                                               Design df         =          79
                                               F(  12,     68)   =      128.06
                                               Prob > F          =      0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
redi_hinc_ln |   .9435509   .0050083   -10.95   0.000     .9336347    .9535725
      dB_fem |   .9366623   .0128455    -4.77   0.000     .9114398    .9625827
   dB_rblack |   1.047596   .0489273     1.00   0.322     .9545984    1.149654
   dB_rasian |   1.055756   .0233517     2.45   0.016     1.010284    1.103275
    dB_rhisp |   .8503091   .0195141    -7.07   0.000      .812341    .8900518
   dB_rother |   1.272419   .0575511     5.33   0.000     1.162872    1.392287
   dB_edu_HS |   1.375375   .0456053     9.61   0.000     1.287531    1.469213
 dB_edu_sCol |   1.481185    .042748    13.61   0.000     1.398495    1.568764
  dB_edu_col |   2.028785   .0684531    20.97   0.000     1.897007    2.169717
 dB_edu_grad |   2.071065   .0785961    19.19   0.000     1.920386    2.233567
     married |   .6049411   .0121287   -25.07   0.000      .581275    .6295709
  disability |     .67765   .0251038   -10.50   0.000     .6294799    .7295062
       _cons |   .2151024   .0152507   -21.67   0.000     .1867913    .2477045
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
. // Original ACS Contnuous Income as IV (acs_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ln(ACS HH income), " ///
>                   "gender, race/ethnicity, education, marriage, disability"
CALIFORNIA: Predict migration as function of ln(ACS HH income), gender, race/eth
> nicity, education, marriage, disability

. svy: logistic migrate ///
>         acs_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability 
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,245
                                               Population size   =  31,307,314
                                               Replications      =          80
                                               Design df         =          79
                                               F(  12,     68)   =      120.98
                                               Prob > F          =      0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 acs_hinc_ln |   .9368348   .0054951   -11.12   0.000     .9259607    .9478367
      dB_fem |   .9369998   .0128294    -4.75   0.000     .9118084    .9628873
   dB_rblack |   1.044921   .0487701     0.94   0.349     .9522192    1.146647
   dB_rasian |   1.050248   .0233386     2.21   0.030     1.004806    1.097745
    dB_rhisp |    .850753     .01943    -7.08   0.000     .8129445      .89032
   dB_rother |   1.275898   .0572507     5.43   0.000     1.166884    1.395097
   dB_edu_HS |   1.375132   .0457051     9.58   0.000     1.287102    1.469182
 dB_edu_sCol |   1.478536   .0430937    13.42   0.000     1.395201    1.566849
  dB_edu_col |    2.03395   .0692733    20.85   0.000     1.900635    2.176616
 dB_edu_grad |   2.084415   .0800331    19.13   0.000     1.931048    2.249962
     married |   .6073822   .0120961   -25.04   0.000     .5837764    .6319426
  disability |   .6798401   .0249417   -10.52   0.000     .6319642    .7313428
       _cons |   .2329548   .0169289   -20.05   0.000     .2015823    .2692098
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. // Artificial ACS categorical Income as IV (acs_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ACS HH income category, " 
> ///
>                   "gender, race/ethnicity, education, marriage, disability"
CALIFORNIA: Predict migration as function of ACS HH income category, gender, rac
> e/ethnicity, education, marriage, disability

. fvset base 1 acs_hinc

. svy: logistic migrate ///
>         i.acs_hinc /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability //  labor  ownhouse
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,245
                                               Population size   =  31,307,314
                                               Replications      =          80
                                               Design df         =          79
                                               F(  19,     61)   =       86.01
                                               Prob > F          =      0.0000

-------------------------------------------------------------------------------
              |                BRR *
      migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     acs_hinc |
15000 to l..  |   .8488902   .0456647    -3.05   0.003     .7626939    .9448281
25000 to l..  |   .7561957   .0470003    -4.50   0.000     .6681994    .8557804
35000 to l..  |   .8496371   .0379762    -3.65   0.000     .7773123    .9286914
50000 to l..  |   .7472799   .0350085    -6.22   0.000     .6807476    .8203148
75000 to l..  |   .7009359   .0319658    -7.79   0.000     .6401119    .7675395
100000 to ..  |   .6731798   .0343055    -7.77   0.000     .6082454    .7450465
150000 to ..  |   .6148361   .0290882   -10.28   0.000       .55958    .6755485
200000 or ..  |   .6711577    .027045    -9.90   0.000     .6194283    .7272071
              |
       dB_fem |   .9322253   .0128641    -5.09   0.000     .9069685    .9581855
    dB_rblack |   1.036941   .0485129     0.78   0.440     .9447381    1.138142
    dB_rasian |   1.057971   .0235499     2.53   0.013     1.012119      1.1059
     dB_rhisp |   .8502226    .019908    -6.93   0.000     .8115059    .8907864
    dB_rother |   1.279752   .0573761     5.50   0.000     1.170495    1.399207
    dB_edu_HS |   1.386862   .0461958     9.82   0.000     1.297893    1.481929
  dB_edu_sCol |   1.501907   .0432948    14.11   0.000     1.418156    1.590603
   dB_edu_col |   2.084941   .0694646    22.05   0.000      1.95116    2.227894
  dB_edu_grad |    2.13285   .0797009    20.27   0.000     1.979965    2.297539
      married |   .6129849    .012167   -24.66   0.000     .5892393    .6376875
   disability |   .6623069    .024461   -11.16   0.000     .6153651    .7128296
        _cons |    .151899   .0071843   -39.85   0.000     .1382516    .1668937
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
.         
. ***------------
. // In both models, significance disappears when add home ownership:
. // REDI Income as IV (redi_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ln(REDI-created income), "
>  ///
>                   "add home ownership"
CALIFORNIA: Predict migration as function of ln(REDI-created income), add home o
> wnership

. svy: logistic migrate ///
>         redi_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability ownhouse  
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,154
                                               Population size   =  31,298,289
                                               Replications      =          80
                                               Design df         =          79
                                               F(  13,     67)   =      226.24
                                               Prob > F          =      0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
redi_hinc_ln |   1.008244    .006745     1.23   0.223      .994907    1.021759
      dB_fem |    .948586   .0131484    -3.81   0.000     .9227725    .9751216
   dB_rblack |   .8777258   .0423629    -2.70   0.008     .7973282    .9662302
   dB_rasian |    1.02268   .0227321     1.01   0.316     .9784195    1.068943
    dB_rhisp |   .7339192   .0177815   -12.77   0.000     .6993659    .7701797
   dB_rother |    1.15526   .0532977     3.13   0.002     1.053899     1.26637
   dB_edu_HS |   1.430486   .0479226    10.69   0.000     1.338209    1.529126
 dB_edu_sCol |     1.5582   .0450596    15.34   0.000     1.471044    1.650521
  dB_edu_col |   2.110224   .0705772    22.33   0.000     1.974318    2.255486
 dB_edu_grad |   2.234607   .0857051    20.96   0.000     2.070364    2.411879
     married |   .7105258   .0138894   -17.48   0.000     .6834105    .7387169
  disability |   .7128211   .0266828    -9.04   0.000     .6616406    .7679606
    ownhouse |   .3213215   .0078422   -46.52   0.000     .3060852    .3373163
       _cons |   .1677235   .0141671   -21.14   0.000     .1417678    .1984315
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. // Original ACS Contnuous Income as IV (acs_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ln(ACS HH income), " ///
>                   "add home ownership"
CALIFORNIA: Predict migration as function of ln(ACS HH income), add home ownersh
> ip

. svy: logistic migrate ///
>         acs_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability ownhouse 
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,245
                                               Population size   =  31,307,314
                                               Replications      =          80
                                               Design df         =          79
                                               F(  13,     67)   =      226.89
                                               Prob > F          =      0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 acs_hinc_ln |   1.001878   .0074817     0.25   0.802     .9870967    1.016882
      dB_fem |   .9476824   .0131068    -3.89   0.000     .9219498    .9741333
   dB_rblack |   .8751409   .0420044    -2.78   0.007     .7954028    .9628727
   dB_rasian |   1.023029   .0227061     1.03   0.308     .9788174    1.069237
    dB_rhisp |   .7339024   .0177706   -12.78   0.000     .6993696    .7701402
   dB_rother |   1.159872   .0532752     3.23   0.002     1.058533    1.270912
   dB_edu_HS |   1.431019   .0479587    10.69   0.000     1.338674    1.529734
 dB_edu_sCol |   1.560721   .0453896    15.31   0.000      1.47294    1.653732
  dB_edu_col |    2.11696   .0719826    22.06   0.000     1.978423    2.265198
 dB_edu_grad |    2.24416   .0874209    20.75   0.000     2.076728    2.425091
     married |   .7116784   .0137926   -17.55   0.000     .6847478    .7396683
  disability |   .7082635   .0261679    -9.34   0.000     .6580467    .7623125
    ownhouse |   .3223763   .0079627   -45.83   0.000     .3069102    .3386218
       _cons |   .1794594   .0155872   -19.78   0.000     .1509677    .2133283
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. // Artificial ACS categorical Income as IV (acs_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ACS HH income category, " 
> ///
>                    "add home ownership"
CALIFORNIA: Predict migration as function of ACS HH income category, add home ow
> nership

. svy: logistic migrate ///
>         i.acs_hinc /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability ownhouse      //  labor  
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,245
                                               Population size   =  31,307,314
                                               Replications      =          80
                                               Design df         =          79
                                               F(  20,     60)   =      155.77
                                               Prob > F          =      0.0000

-------------------------------------------------------------------------------
              |                BRR *
      migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     acs_hinc |
15000 to l..  |   .8706044   .0475565    -2.54   0.013     .7809101    .9706009
25000 to l..  |   .8038191   .0512296    -3.43   0.001      .708052    .9125392
35000 to l..  |   .9438112   .0414947    -1.32   0.192     .8647289    1.030126
50000 to l..  |   .8890944    .041048    -2.55   0.013     .8110321    .9746703
75000 to l..  |   .8921543   .0401655    -2.53   0.013     .8156843    .9757933
100000 to ..  |   .9476325   .0471918    -1.08   0.283     .8582049    1.046379
150000 to ..  |   .9361407   .0452726    -1.36   0.176     .8502291    1.030733
200000 or ..  |   1.119829   .0469183     2.70   0.008     1.030228    1.217222
              |
       dB_fem |   .9522996   .0133383    -3.49   0.001     .9261171    .9792223
    dB_rblack |   .8830703   .0427252    -2.57   0.012     .8019945    .9723423
    dB_rasian |   1.015603   .0226405     0.69   0.489     .9715238    1.061683
     dB_rhisp |   .7463961   .0183766   -11.88   0.000     .7107001    .7838849
    dB_rother |    1.15741   .0531921     3.18   0.002     1.056232     1.26828
    dB_edu_HS |   1.434405   .0482595    10.72   0.000     1.341493    1.533753
  dB_edu_sCol |   1.557041    .044914    15.35   0.000      1.47016    1.649056
   dB_edu_col |   2.059001   .0676845    21.97   0.000     1.928591    2.198229
  dB_edu_grad |   2.141925   .0801835    20.35   0.000     1.988125    2.307623
      married |   .7069823   .0137334   -17.85   0.000     .6801685    .7348532
   disability |   .7139159    .026807    -8.97   0.000     .6625032    .7693184
     ownhouse |   .3129324   .0077767   -46.75   0.000     .2978298    .3288008
        _cons |   .1980513   .0095973   -33.41   0.000     .1798408    .2181058
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
. ***--------------------------***
. 
. capture log close redi15_REDI_state_regressions
