--------------------------------------------------------------------------------
      name:  master
       log:  /Users/mollymking/Documents/SocResearch/Dissertation/redi/redi00_ma
> ster.log
  log type:  text
 opened on:   9 Nov 2021, 19:30:28

. 
. set more off

. 
. ** Master REDI Method Do File ***
. 
. //      project:        REDI Methodology Paper
. 
. //  task:               Master file to rerun sequence of do-files to reproduce
>  all work
. //                              related to REDI Method Paper
. //                              This will run all files in folder: redi
. 
. //  program:    redi00_master.do
. //      log:            redi00_master.log
. 
. //  github:             dissertation_code
. //  OSF:                https://osf.io/qmhe8/
. 
. //  author:             Molly King
. 
. display "$S_DATE  $S_TIME"
 9 Nov 2021  19:30:28

. ***--------------------------***
. 
. // CHANGE DIRECTORIES to local files to run replication code:
. 
. global redi     "~/Documents/SocResearch/Dissertation/redi"                   
>           // where all replication .do files stored       

. 
. *Data
. global source   "~/Documents/SocResearch/Dissertation/data/data_sorc"   // ori
> ginal datasets (ACS, CPS ASEC)

. global extr     "~/Documents/SocResearch/Dissertation/data/data_extr"   // ext
> racted datasets - a file to extract original data

. global temp             "~/Documents/SocResearch/Dissertation/data/data_temp" 
>   // temporary datasets - an empty file to store temporary data

. global deriv    "~/Documents/SocResearch/Dissertation/data/data_derv"   // der
> ived datasets - a file to store final data

. 
. * remove comment to run all files, or comment-out one at a time
. 
. ***--------------------------***
. // 01 IMPORT, EXTRACTION, CLEAN 
. ***--------------------------***
. 
. *do $redi/redi01_CPI-U-RS.do                            // Import and extract 
> CPI-U-RS inflation index, calculate year adjustment
. *do $redi/redi01_ASEC_import.do                         // Import and extract 
> CPS ASEC
. *do $redi/redi01_ACS_import.do                          // Import and extract 
> ACS
. 
. ***--------------------------***
. // 02-03 REDI METHOD
. ***--------------------------***
. 
. *do $redi/redi02_ACS_bins.do                            // Create ACS artifici
> al data bins
. *do $redi/redi03_ACS_convert.do                                 // Convert bin
> s back to continuous income, inflate 2016 incomes to 2017 dollar values
. 
. ***--------------------------***
. // 04-07 DESCRIPTIVES 
. ***--------------------------***
. 
. *do $redi/redi04_ACS_descriptives.do            // Descriptive data tables of 
> original continuous ACS Variables (research dataset)
. *do $redi/redi05_ASEC_bins.do                           // Create ASEC artific
> ial data bins for comparison
. *do $redi/redi06_ASEC_descriptives.do           // Descriptive data tables of 
> original CPS ASEC Variables
. *do $redi/redi07_REDI_descriptives.do           // Descriptive data tables of 
> continuous REDI-created Variables
. 
. ***--------------------------***
. // 08-10 DISTRIBUTIONS
. ***--------------------------***
. *do $redi/redi08_ACS_ASEC_distrib_match.do      // Compare binned distribution
> s of ACS and CPS ASEC
. *do $redi/redi09_REDI_ACS_distrib_match.do      // Compare continuous distribu
> tions from original ACS & REDI
. *do $redi/redi10_REDI_summary_stats.do          // Summary Statistics of conti
> nuous REDI-created variables, optionally replicated x times
. *do $redi/redi10a_REDI_reps_append.do           // Append x replications of da
> ta produced in redi10 - only for proof-of-concept
. 
. ***--------------------------***
. // 11-12 REGRESSIONS
. ***--------------------------***
. 
. *do $redi/redi11_ASEC_regressions.do            // Regression of original cont
> inuous CPS ASEC variables
. *do $redi/redi12_REDI_regressions.do            // Regressions of original ASE
> C variables and new continuous REDI-created income
. 
. ***--------------------------***
. // 13 REGRESSION EXAMPLE USING INDIVIDUAL STATES
. ***--------------------------***
. 
. *do $redi/redi13_REDI_state_demvars.do          // Create demographic variable
> s for state data
. do $redi/redi14_REDI_state_dataprep.do          // Create REDI-generated incom
> e and artificial ACS bins

. capture log close redi14_REDI_state_dataprep

. log using $redi/redi14_REDI_state_dataprep.log, name(redi14_REDI_state_datapre
> p) replace text
--------------------------------------------------------------------------------
      name:  redi14_REDI_state_dataprep
       log:  /Users/mollymking/Documents/SocResearch/Dissertation/redi/redi14_RE
> DI_state_dataprep.log
  log type:  text
 opened on:   9 Nov 2021, 19:30:28

. 
. //      project:        REDI Methods Paper
. 
. //  task:       Creating state samples and REDI income for state example
. //  data:       CPS ASEC from IPUMS, available: https://cps.ipums.org/
. //                              ACS from IPUMS, available: https://usa.ipums.o
> rg/
. 
. //  github:     redi
. //  OSF:                https://osf.io/qmhe8/
. 
. //  author:     Molly King
. 
. display "$S_DATE  $S_TIME"
 9 Nov 2021  19:30:28

. 
. ***--------------------------***
. // # PROGRAM SETUP
. ***--------------------------***
. 
. version 16 // keeps program consistent for future replications

. set linesize 80

. clear all

. set more off

. set seed 1

. 
. ***--------------------------***
. // # CREATE CPS-ASEC STATE SELECTIONS
. ***--------------------------***
. 
. use $deriv/redi01_ASEC-hhincome_all.dta, clear
(CPS ASEC data - Household Income - 2016, 2017, 2019)

. keep if year == 2019
(139,441 observations deleted)

. drop serial county

. label data "Streamlined CPS ASEC data, 2019"

. save $temp/redi14_cps_state_example.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_exampl
> e.dta saved

. 
. keep if statefip == 6 // California
(62,085 observations deleted)

. label data "Streamlined CPS ASEC data, CA 2019"

. save $temp/redi14_cps_state_ca.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_ca.dta
>  saved

. 
. use $temp/redi14_cps_state_example.dta, clear
(Streamlined CPS ASEC data, 2019)

. keep if statefip == 56 // Wyoming
(67,426 observations deleted)

. label data "Streamlined CPS ASEC data, WY 2019"

. save $temp/redi14_cps_state_wy.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_wy.dta
>  saved

. 
. 
. ***--------------------------***
. // # PREP ACS RESEARCH DATASET
. ***--------------------------***
. 
. use $deriv/redi13_REDI_state_demvars.dta, clear
(ACS data with DEMOGRAPHIC VARIABLES)

. keep if year == 2019
(6,346,527 observations deleted)

. * Drop extraneous variables
. label data "Streamlined ACS data, 2019"

. datasignature set, reset 
  3239553:209(55251):1894994316:673242353       (data signature reset)

. 
. *arbitrary categories invented to demonstrate flexibility of method
. label define cat_inc                            ///
>         1       "Less than $15000"                              ///
>         2       "15000 to less than 25000"              ///
>         3       "25000 to less than 35000"              ///
>         4       "35000 to less than 50000"              ///
>         5       "50000 to less than 75000"              ///
>         6       "75000 to less than 100000"     ///
>         7       "100000 to less than 150000"    ///
>         8       "150000 to less than 200000"    ///
>         9       "200000 or more"                                //

.         
. gen     acs_hhinc = .
(3,239,553 missing values generated)

. replace acs_hhinc = 1 if hhincome_acs                                         
>      <= 15000
(190,626 real changes made)

. replace acs_hhinc = 2 if hhincome_acs  > 15000  & hhincome_acs <= 25000
(182,072 real changes made)

. replace acs_hhinc = 3 if hhincome_acs  > 25000  & hhincome_acs <= 35000
(205,123 real changes made)

. replace acs_hhinc = 4 if hhincome_acs  > 35000  & hhincome_acs <= 50000 
(332,557 real changes made)

. replace acs_hhinc = 5 if hhincome_acs  > 50000  & hhincome_acs <= 75000 
(522,013 real changes made)

. replace acs_hhinc = 6 if hhincome_acs  > 75000  & hhincome_acs <= 100000
(444,753 real changes made)

. replace acs_hhinc = 7 if hhincome_acs  > 100000 & hhincome_acs <= 150000 
(574,195 real changes made)

. replace acs_hhinc = 8 if hhincome_acs  > 150000 & hhincome_acs <= 200000
(280,282 real changes made)

. replace acs_hhinc = 9 if hhincome_acs  > 200000 & hhincome_acs != 9999999 
(356,611 real changes made)

. replace acs_hhinc = . if hhincome_acs == 9999999 
(0 real changes made)

. replace acs_hhinc = . if hhincome_acs == .
(0 real changes made)

. 
. label values acs_hhinc cat_inc

. label var acs_hhinc "Household Income (ACS) arbitrary categories based on hhin
> come_acs"

. notes acs_hhinc: ACS Household Income Categories from hhincome_acs \ $S_DATE

. 
. tab acs_hhinc, m

    Household Income (ACS) |
arbitrary categories based |
           on hhincome_acs |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
          Less than $15000 |    190,626        5.88        5.88
  15000 to less than 25000 |    182,072        5.62       11.50
  25000 to less than 35000 |    205,123        6.33       17.84
  35000 to less than 50000 |    332,557       10.27       28.10
  50000 to less than 75000 |    522,013       16.11       44.22
 75000 to less than 100000 |    444,753       13.73       57.94
100000 to less than 150000 |    574,195       17.72       75.67
150000 to less than 200000 |    280,282        8.65       84.32
            200000 or more |    356,611       11.01       95.33
                         . |    151,321        4.67      100.00
---------------------------+-----------------------------------
                     Total |  3,239,553      100.00

. *tab acs_hhinc, m nolab
. 
. save $temp/redi14_ACS2019.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_ACS2019.dta save
> d

. 
. ***--------------------------***
. // # CREATE ACS STATE SELECTIONS
. ***--------------------------***
. 
. use $temp/redi14_ACS2019.dta, clear
(Streamlined ACS data, 2019)

. keep if statefip == 6 // California
(2,859,462 observations deleted)

. label data "ACS data with artificial bins, CA 2019"

. save $temp/redi14_ACS2019CA.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_ACS2019CA.dta sa
> ved

. 
. use $temp/redi14_ACS2019.dta, clear
(Streamlined ACS data, 2019)

. keep if statefip == 56 // Wyoming
(3,233,586 observations deleted)

. label data "ACS data with artificial bins, WY 2019"

. save $temp/redi14_ACS2019WY.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_ACS2019WY.dta sa
> ved

. 
. /*
> ***--------------------------***
> // # COMPLETE REDI CONVERSIONS ON 2019 Wyoming  DATA
> ***--------------------------***
> * cps_reference "$temp/redi14_cps_state_wy"
> * change line 125 in redi03a_categ_distrib to "use $temp/redi13_cps_state_wy.d
> ta, clear"
> 
> *year of conversion factor
> local year "year"
> 
> use $temp/redi14_ACS2019WY.dta, clear
> 
> // Income Conversions
> rename acs_hhinc acs_hinc_shp
> include $redi/redi03a_categ_distrib.doi
> 
> // Clean Up
> keep if year == 2019
> drop gq sample serial cbserial countyfip age nchild whymove union  month
> svyset[pweight=perwt], vce(brr) brrweight(repwtp1-repwtp80) fay(.5)mse
> 
> rename hhincome_asec redi_hinc 
> rename acs_hinc_shp acs_hinc
> order acs_hinc redi_hinc hhincome_acs acs_hinc_shp_lb acs_hinc_shp_ub 
> 
> 
> // CREATE NATURAL LOG INCOME VARIABLES
> gen redi_hinc_ln = ln(redi_hinc)
> replace redi_hinc_ln = 0 if redi_hinc == 0
> 
> gen acs_hinc_ln = ln(hhincome_acs)
> replace acs_hinc_ln = 0 if hhincome_acs == 0
> 
> // Save Data 
> label data "Wyoming 2019 ACS data converted to continuous REDI-calculated valu
> es"
> notes: redi13_REDI_Wy2019.dta \ ///
>         ACS hinc_shp Data converted to continuous REDI \ /// 
>         redi13_REDI_state_example.do  $S_DATE
> 
> compress
> datasignature set, reset  
> save $deriv/redi14_REDI_Wy2019.dta, replace
> 
> di in red "Completed REDI conversions for Wyoming 2019 data" 
> */
. ***--------------------------***
. // # COMPLETE REDI CONVERSIONS ON 2019 California  DATA
. ***--------------------------***
. * cps_reference "$temp/redi14_cps_state_ca"
. * change line 125 in redi03a_categ_distrib to "use $temp/redi13_cps_state_ca.d
> ta, clear"
. 
. *year of conversion factor
. local year "year"

. 
. use $temp/redi14_ACS2019CA.dta, clear
(ACS data with artificial bins, CA 2019)

. 
. // Income Conversions
. rename acs_hhinc acs_hinc_shp

. include $redi/redi03a_categ_distrib.doi

. *! Include file to convert categorical to continuous income values, independen
> t of values of categories
. *! creates numeric variables indicating edges of income categories,
. *! and draws random continuous income from CPS-ASEC from between those edges
. 
. *! version 4.0 \ molly king 2020-08-25
. 
. ***--------------------------***
. 
. // #1 SETUP
.         *noisily
.         *set seed 1 // when commented out - selection from CPS-ASEC is random
.         compress
  variable dB_fem was float now byte
  variable hisp was float now byte
  variable dB_rwhite was float now byte
  variable dB_rblack was float now byte
  variable dB_rasian was float now byte
  variable dB_rhisp was float now byte
  variable dB_rother was float now byte
  variable dG_race was float now byte
  variable dG_edu was float now byte
  variable dB_edu_lHS was float now byte
  variable dB_edu_HS was float now byte
  variable dB_edu_sCol was float now byte
  variable dB_edu_col was float now byte
  variable dB_edu_grad was float now byte
  variable dB_edu_colp was float now byte
  variable disability was float now byte
  variable married was float now byte
  variable ownhouse was float now byte
  variable migrate was float now byte
  variable acs_hinc_shp was float now byte
  (22,805,460 bytes saved)

. 
.         cd $temp
/Users/mollymking/Documents/SocResearch/Dissertation/data/data_temp

.         
.         //Create local for levels of income = e.g., levelsof year, local(years
> )
.         levelsof acs_hinc_shp, local("acs_hinc_shp_levels")
1 2 3 4 5 6 7 8 9

. 
.         // sort for later join & create variable recording the original observ
> ation order within the identifier
.         *bysort year acs_hinc_shp: gen year_inc_id = _n
.         bysort year acs_hinc_shp: gen id = _n

. 
. // #2 create numeric variables indicating edges of income categories //
.         // Note: for more detail on if-command and Stata regular expressions u
> sed to create this, see:
.                 *http://www.stata.com/statalist/archive/2013-03/msg00654.html
.                 *http://www.stata.com/support/faqs/programming/if-command-vers
> us-if-qualifier/
.                 *http://stats.idre.ucla.edu/stata/faq/how-can-i-extract-a-port
> ion-of-a-string-variable-using-regular-expressions/
. 
.         // List income levels
.         di in red "The income levels are: " "`acs_hinc_shp_levels'"
The income levels are: 1 2 3 4 5 6 7 8 9

. 
.         * Decode converts labels to string variables for acs_hinc_shp
.         decode acs_hinc_shp, gen(inc_decoded)

. 
.         tempfile working_regex

.         save `working_regex', replace
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000001 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000001 saved

. 
.         
.         //Levels of year variable to loop through years in dataset
.         levelsof year, local(years)
2019

.         di in red  "Create local variable years to loop through within that in
> come bracket - values:" `years'
Create local variable years to loop through within that income bracket - values:
> 2019

. 
.         foreach y of local years { // loop through all years
  2. 
.         
.                 // loop through all values of income categories (`inc_level')
.                 foreach inc_level of local acs_hinc_shp_levels {
  3. 
.                         use `working_regex', clear
  4. 
.                         // Keep the data if the income variable is equal to th
> e current income level (of the loop)
.                         keep if acs_hinc_shp == `inc_level'  // do this to mak
> e sure not replacing things with wrong level later
  5.                         di "The current inc_level is: " `inc_level'
  6. 
.                         // text at beginning of the string:
.                                 if regexm(inc_decoded, "^[a-z/A-Z]+") == 1 {
  7.                                         di "The inc_level " `inc_level' " i
> s at the lowest end of the original ACS income range"
  8.                                         // for lower-bound values, will mat
> ch if text at beginning of line
.                                         destring inc_decoded, ignore("Less tha
> n LESS THAN Under,$ ") generate(acs_hinc_shp_ub) // parses out these words
  9.                                         gen acs_hinc_shp_lb = -100000
 10.                                         di "Lower bound of -100,000 created
>  for inc_level " `inc_level'
 11.                                 }
 12. 
.                         // text at end of the string:
.                                 else if regexm(inc_decoded, "[a-z/A-Z]+$") == 
> 1 {
 13.                                         di "The inc_level " `inc_level' " i
> s at the highest end of the original ACS income range"
 14.                                         // for upper-bound values, will mat
> ch if text at end of line
.                                         destring inc_decoded, ignore("and over
>  or over,$ or more OR MORE") generate(acs_hinc_shp_lb) // parses out these wor
> ds
 15.                                         gen acs_hinc_shp_ub = 999999  // my
>  topcode for asec purposes
 16.                                         di "Upper bound of 999999 created f
> or inc_level " `inc_level'
 17.                                 }
 18. 
.                         // if acs_hinc_shp is missing, keep it missing for low
> er_bound and upper_bound
.                                 else if regexm(inc_decoded, "[.][a-z]") == 1 {
 19.                                         di "The inc_level " `inc_level' " i
> s all missing"
 20.                                  // for missing values (a bit excessive, si
> nce already missing, but good to be sure)
.                                         gen acs_hinc_shp_lb = .
 21.                                         gen acs_hinc_shp_ub = .
 22.                                         di "Lower and upper bound of . crea
> ted for inc_level " `inc_level'
 23.                                 }
 24. 
.                         // for labels with 2 numbers in them
.                                 else if regexm(inc_decoded, "[0-9]+$") == 1 {
 25.                                 // regex "[0-9]+$" will match anything of f
> orm $0000 or 0000 at end of line -
.                                 // since those at lowest and highest ranges ha
> ve already been matched (using text), this leaves those with ranges
.                                                 di "The inc_level " `inc_level
> ' " has a lower and an upper level"
 26.                                                 split inc_decoded, ///
>                                                         parse("-" "to" "-" "to
>  under" "to less than" "UP TO" "but less than") ///
>                                                         ignore(" ,$") destring
 27.                                                 gen acs_hinc_shp_lb = inc_d
> ecoded1
 28.                                                 gen acs_hinc_shp_ub = inc_d
> ecoded2
 29.                                                 di "Lower bound of acs_hinc
> _shp_lb and upper bound of acs_hinc_shp_ub created for inc_level " `inc_level'
>  "of the original ACS income range"
 30.                                 }
 31. 
.                         // error - in case doesn't fit any existing category
.                                 else {
 32.                                         di "The inc_level " `inc_level' " d
> oes not fit any of the existing regular expressions designs."
 33.                                 }
 34. 
.                         // create locals to use later for selecting appropriat
> e ASEC bounds
.                                 local upper_bound = acs_hinc_shp_ub
 35.                                 local lower_bound = acs_hinc_shp_lb
 36. 
.                 // drop variables used in creating lower and upper bounds
.                         capture drop inc_decoded1 inc_decoded2
 37. 
.                 // #3A Now, still within the single-income-level loop in ACS d
> ataset:
. 
.                         // summarize so can get count of how many individuals 
> in that income level during year
.                                 quietly summarize if year == `y' & acs_hinc_sh
> p == `inc_level'
 38.                                 local sample_size = r(N) // count how many 
> rows there are in survey dataset
 39.                                   // count N_B for each bin (# of observati
> ons in ACS income category between L_bn and U_bn)
.                                 
.                                 // create count within each ACS income bin
.                                 gen acs_hinc_shp_n = `sample_size' // contains
>  size of bin in ACS dataset
 40.                                 label variable acs_hinc_shp_n "household (A
> CS) shp count of respondents in each income bin in original (research) dataset
> "
 41. 
. 
.                         // create temporary file of just this ACS income level
>  and year
.                                 keep if year == `y' & acs_hinc_shp == `inc_lev
> el'
 42.                                 tempfile premerge_`inc_level'_`y'
 43.                                 save `premerge_`inc_level'_`y'', replace
 44.                                 
.                                 *use $deriv/redi01_ASEC-hhincome.dta, clear //
>  use ASEC household dataset
.                                 use $temp/redi14_cps_state_ca.dta, clear // $t
> emp/redi14_cps_state_wy.dta
 45.                                 di "Calculating household income using hhin
> come ASEC variable."
 46. 
.                         // #3B) Takes a random draw of number of incomes w/in 
> that income boundary and year from the CPS-ASEC
.                         // Keep ASEC data if within income bounds and for give
> n year
. 
.                                 keep if year == `y' & ///
>                                         hhincome_asec >= `lower_bound' & ///
>                                         hhincome_asec <= `upper_bound'
 47.                                 gen obs_no = _n
 48.                                 save "$temp/redi03_ASEC-hhincome_year_inc`i
> nc_level'.dta", replace
 49.                                 di "Keep income between $`lower_bound' and 
> $`upper_bound' for `y' year."
 50.                         
.                         // #3C) Sample, with replacement, such that ASEC incom
> e has an equal 
.                         // probability assigned to each observation in this ar
> tificial data set 
.                         // (which will later be matched to ACS data set)
.                         // Thanks to Clyde Schechter; https://www.statalist.or
> g/forums/forum/general-stata-discussion/general/1475890-is-there-a-command-tha
> t-is-equivalent-to-bsample-more-than-_n
.                                 quietly des 
 51.                                 local N = r(N)
 52. 
.                                 clear
 53.                                 set obs `sample_size'
 54.                                 *set seed 1
. 
.                                 gen obs_no = runiformint(1, `N')
 55.                                 merge m:1 obs_no using "$temp/redi03_ASEC-h
> hincome_year_inc`inc_level'.dta", keep(match) nogenerate 
 56.                                                                            
>                              
.                         // #3D) Add new columns for lower_bound and upper_boun
> d of income bin
.                                 gen acs_hinc_shp_lb = `lower_bound'
 57.                                 gen acs_hinc_shp_ub = `upper_bound'
 58.                         // Label new upper and lower income bound variables
.                                 label variable acs_hinc_shp_lb "acs_hinc_shp L
> ower Bound"
 59.                                 label variable acs_hinc_shp_ub "acs_hinc_sh
> p Upper Bound"
 60. 
.                                 save "$temp/redi03_ASEC-hhincome_year_inc`inc_
> level'.dta", replace
 61.                                 
. 
.                         // #4) Merge ACS (using=premerge) and ASEC data (maste
> r) 
.                         // here, ASEC artificial datase (from step 3A) is matc
> hed 
.                         // to ACS for that incomebin for that year            
>                                                   
.                                 gen id = _n
 62.                                 merge 1:1 id using `premerge_`inc_level'_`y
> ''
 63.                                 
.                                 di "Merged ASEC values with original ACS datas
> et for inc_level " `inc_level' ///
>                                    " ($`lower_bound'-`upper_bound') and year `
> y'."
 64.                                                 
.                         // #5) create count within each REDI income bin
.                                 generate        redi_hinc_shp_n = .
 65.                                 replace         redi_hinc_shp_n = `N' // r(
> N) from above
 66.                                 label var       redi_hinc_shp_n "household 
> (REDI) shp count of respondents in each income bin in post-merge dataset'"
 67. 
.                         // Save these new redi data (with yearly ASEC continuo
> us data) in a tempfile we can use later for merging, etc.
.                                 tempfile temp_`inc_level'_`y'
 68.                                 save `temp_`inc_level'_`y'', replace
 69.                                 di "Saved REDI data (with ASEC continuous d
> ata) for inc_level " `inc_level' " ($`lower_bound'-`upper_bound') and year `y'
>  in file"
 70.                 
.                 }  //  close loop through all values of income categories (`in
> c_level')
 71.                                 
.                 di  in red "Moved outside loop of year income bracket " `inc_l
> evel' " ($`lower_bound'-`upper_bound')."
 72.                 
.                 // append all income brackets across all years
.                         tokenize `acs_hinc_shp_levels'
 73.                         local first `1'
 74.                         use `temp_`1'_`y'', clear
 75.                         macro shift
 76.                         local rest `*'
 77. 
.                 // now loop through and append each temp file created within i
> ncome bracket loop
.                         foreach bracket in `*' {
 78.                                 append using `temp_`bracket'_`y''
 79.                         }
 80. 
.                 // create new tempfile to save each year's data for all income
>  levels
.                         tempfile temp_`y'
 81.                         save `temp_`y'', replace
 82.                         di "Saved new tempfile  for year `y' for all REDI i
> ncome brackets."
 83. 
.                                                 
.         } //  end of loop through all years
(ACS data with artificial bins, CA 2019)
(362,110 observations deleted)
The current inc_level is: 1
The inc_level 1 is at the lowest end of the original ACS income range
inc_decoded: characters L e s space t h a n $ removed; acs_hinc_shp_ub generated
>  as int
Lower bound of -100,000 created for inc_level 1
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000002 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000002 saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,679 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc1.dta saved
Keep income between $-100000 and $15000 for 2019 year.
number of observations (_N) was 0, now 17,981

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,981  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc1.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,981  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 1 ($-100000-15000) an
> d year 2019.
(17,981 missing values generated)
(17,981 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000003 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000003 saved
Saved REDI data (with ASEC continuous data) for inc_level 1 ($-100000-15000) and
>  year 2019 in file
(ACS data with artificial bins, CA 2019)
(362,779 observations deleted)
The current inc_level is: 2
The inc_level 2 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as int
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 2of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000004 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000004 saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,775 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc2.dta saved
Keep income between $15000 and $25000 for 2019 year.
number of observations (_N) was 0, now 17,312

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,312  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc2.dta saved
--Break--
r(1);
--Break--
r(1);

end of do-file
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "/var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//SD04358.000000"

. capture log close redi14_REDI_state_dataprep

. log using $redi/redi14_REDI_state_dataprep.log, name(redi14_REDI_state_datapre
> p) replace text
--------------------------------------------------------------------------------
      name:  redi14_REDI_state_dataprep
       log:  /Users/mollymking/Documents/SocResearch/Dissertation/redi/redi14_RE
> DI_state_dataprep.log
  log type:  text
 opened on:   9 Nov 2021, 19:33:25

. 
. //      project:        REDI Methods Paper
. 
. //  task:       Creating state samples and REDI income for state example
. //  data:       CPS ASEC from IPUMS, available: https://cps.ipums.org/
. //                              ACS from IPUMS, available: https://usa.ipums.o
> rg/
. 
. //  github:     redi
. //  OSF:                https://osf.io/qmhe8/
. 
. //  author:     Molly King
. 
. display "$S_DATE  $S_TIME"
 9 Nov 2021  19:33:25

. 
. ***--------------------------***
. // # PROGRAM SETUP
. ***--------------------------***
. 
. version 16 // keeps program consistent for future replications

. set linesize 80

. clear all

. set more off

. set seed 1

. 
. ***--------------------------***
. // # CREATE CPS-ASEC STATE SELECTIONS
. ***--------------------------***
. 
. use $deriv/redi01_ASEC-hhincome_all.dta, clear
(CPS ASEC data - Household Income - 2016, 2017, 2019)

. keep if year == 2019
(139,441 observations deleted)

. drop serial county

. label data "Streamlined CPS ASEC data, 2019"

. save $temp/redi14_cps_state_example.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_exampl
> e.dta saved

. 
. keep if statefip == 6 // California
(62,085 observations deleted)

. label data "Streamlined CPS ASEC data, CA 2019"

. save $temp/redi14_cps_state_ca.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_ca.dta
>  saved

. 
. use $temp/redi14_cps_state_example.dta, clear
(Streamlined CPS ASEC data, 2019)

. keep if statefip == 56 // Wyoming
(67,426 observations deleted)

. label data "Streamlined CPS ASEC data, WY 2019"

. save $temp/redi14_cps_state_wy.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_wy.dta
>  saved

. 
. 
. ***--------------------------***
. // # PREP ACS RESEARCH DATASET
. ***--------------------------***
. 
. use $deriv/redi13_REDI_state_demvars.dta, clear
(ACS data with DEMOGRAPHIC VARIABLES)

. keep if year == 2019
(6,346,527 observations deleted)

. * Drop extraneous variables
. label data "Streamlined ACS data, 2019"

. datasignature set, reset 
  3239553:209(55251):1894994316:673242353       (data signature reset)

. 
. *arbitrary categories invented to demonstrate flexibility of method
. label define cat_inc                            ///
>         1       "Less than $15000"                              ///
>         2       "15000 to less than 25000"              ///
>         3       "25000 to less than 35000"              ///
>         4       "35000 to less than 50000"              ///
>         5       "50000 to less than 75000"              ///
>         6       "75000 to less than 100000"     ///
>         7       "100000 to less than 150000"    ///
>         8       "150000 to less than 200000"    ///
>         9       "200000 or more"                                //

.         
. gen     acs_hhinc = .
(3,239,553 missing values generated)

. replace acs_hhinc = 1 if hhincome_acs                                         
>      <= 15000
(190,626 real changes made)

. replace acs_hhinc = 2 if hhincome_acs  > 15000  & hhincome_acs <= 25000
(182,072 real changes made)

. replace acs_hhinc = 3 if hhincome_acs  > 25000  & hhincome_acs <= 35000
(205,123 real changes made)

. replace acs_hhinc = 4 if hhincome_acs  > 35000  & hhincome_acs <= 50000 
(332,557 real changes made)

. replace acs_hhinc = 5 if hhincome_acs  > 50000  & hhincome_acs <= 75000 
(522,013 real changes made)

. replace acs_hhinc = 6 if hhincome_acs  > 75000  & hhincome_acs <= 100000
(444,753 real changes made)

. replace acs_hhinc = 7 if hhincome_acs  > 100000 & hhincome_acs <= 150000 
(574,195 real changes made)

. replace acs_hhinc = 8 if hhincome_acs  > 150000 & hhincome_acs <= 200000
(280,282 real changes made)

. replace acs_hhinc = 9 if hhincome_acs  > 200000 & hhincome_acs != 9999999 
(356,611 real changes made)

. replace acs_hhinc = . if hhincome_acs == 9999999 
(0 real changes made)

. replace acs_hhinc = . if hhincome_acs == .
(0 real changes made)

. 
. label values acs_hhinc cat_inc

. label var acs_hhinc "Household Income (ACS) arbitrary categories based on hhin
> come_acs"

. notes acs_hhinc: ACS Household Income Categories from hhincome_acs \ $S_DATE

. 
. tab acs_hhinc, m

    Household Income (ACS) |
arbitrary categories based |
           on hhincome_acs |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
          Less than $15000 |    190,626        5.88        5.88
  15000 to less than 25000 |    182,072        5.62       11.50
  25000 to less than 35000 |    205,123        6.33       17.84
  35000 to less than 50000 |    332,557       10.27       28.10
  50000 to less than 75000 |    522,013       16.11       44.22
 75000 to less than 100000 |    444,753       13.73       57.94
100000 to less than 150000 |    574,195       17.72       75.67
150000 to less than 200000 |    280,282        8.65       84.32
            200000 or more |    356,611       11.01       95.33
                         . |    151,321        4.67      100.00
---------------------------+-----------------------------------
                     Total |  3,239,553      100.00

. *tab acs_hhinc, m nolab
. 
. save $temp/redi14_ACS2019.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_ACS2019.dta save
> d

. 
. ***--------------------------***
. // # CREATE ACS STATE SELECTIONS
. ***--------------------------*
. 
end of do-file

. do "/var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//SD04358.000000"

. 
. ***--------------------------***
. // # COMPLETE REDI CONVERSIONS ON 2019 California  DATA
. ***--------------------------***
. * cps_reference "$temp/redi14_cps_state_ca"
. * change line 125 in redi03a_categ_distrib to "use $temp/redi13_cps_state_ca.d
> ta, clear"
. 
. *year of conversion factor
. local year "year"

. 
. use $temp/redi14_ACS2019CA.dta, clear
(ACS data with artificial bins, CA 2019)

. 
. // Income Conversions
. rename acs_hhinc acs_hinc_shp

. include $redi/redi03a_categ_distrib.doi

. *! Include file to convert categorical to continuous income values, independen
> t of values of categories
. *! creates numeric variables indicating edges of income categories,
. *! and draws random continuous income from CPS-ASEC from between those edges
. 
. *! version 4.0 \ molly king 2020-08-25
. 
. ***--------------------------***
. 
. // #1 SETUP
.         *noisily
.         *set seed 1 // when commented out - selection from CPS-ASEC is random
.         compress
  variable dB_fem was float now byte
  variable hisp was float now byte
  variable dB_rwhite was float now byte
  variable dB_rblack was float now byte
  variable dB_rasian was float now byte
  variable dB_rhisp was float now byte
  variable dB_rother was float now byte
  variable dG_race was float now byte
  variable dG_edu was float now byte
  variable dB_edu_lHS was float now byte
  variable dB_edu_HS was float now byte
  variable dB_edu_sCol was float now byte
  variable dB_edu_col was float now byte
  variable dB_edu_grad was float now byte
  variable dB_edu_colp was float now byte
  variable disability was float now byte
  variable married was float now byte
  variable ownhouse was float now byte
  variable migrate was float now byte
  variable acs_hinc_shp was float now byte
  (22,805,460 bytes saved)

. 
.         cd $temp
/Users/mollymking/Documents/SocResearch/Dissertation/data/data_temp

.         
.         //Create local for levels of income = e.g., levelsof year, local(years
> )
.         levelsof acs_hinc_shp, local("acs_hinc_shp_levels")
1 2 3 4 5 6 7 8 9

. 
.         // sort for later join & create variable recording the original observ
> ation order within the identifier
.         *bysort year acs_hinc_shp: gen year_inc_id = _n
.         bysort year acs_hinc_shp: gen id = _n

. 
. // #2 create numeric variables indicating edges of income categories //
.         // Note: for more detail on if-command and Stata regular expressions u
> sed to create this, see:
.                 *http://www.stata.com/statalist/archive/2013-03/msg00654.html
.                 *http://www.stata.com/support/faqs/programming/if-command-vers
> us-if-qualifier/
.                 *http://stats.idre.ucla.edu/stata/faq/how-can-i-extract-a-port
> ion-of-a-string-variable-using-regular-expressions/
. 
.         // List income levels
.         di in red "The income levels are: " "`acs_hinc_shp_levels'"
The income levels are: 1 2 3 4 5 6 7 8 9

. 
.         * Decode converts labels to string variables for acs_hinc_shp
.         decode acs_hinc_shp, gen(inc_decoded)

. 
.         tempfile working_regex

.         save `working_regex', replace
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000001 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000001 saved

. 
.         
.         //Levels of year variable to loop through years in dataset
.         levelsof year, local(years)
2019

.         di in red  "Create local variable years to loop through within that in
> come bracket - values:" `years'
Create local variable years to loop through within that income bracket - values:
> 2019

. 
.         foreach y of local years { // loop through all years
  2. 
.         
.                 // loop through all values of income categories (`inc_level')
.                 foreach inc_level of local acs_hinc_shp_levels {
  3. 
.                         use `working_regex', clear
  4. 
.                         // Keep the data if the income variable is equal to th
> e current income level (of the loop)
.                         keep if acs_hinc_shp == `inc_level'  // do this to mak
> e sure not replacing things with wrong level later
  5.                         di "The current inc_level is: " `inc_level'
  6. 
.                         // text at beginning of the string:
.                                 if regexm(inc_decoded, "^[a-z/A-Z]+") == 1 {
  7.                                         di "The inc_level " `inc_level' " i
> s at the lowest end of the original ACS income range"
  8.                                         // for lower-bound values, will mat
> ch if text at beginning of line
.                                         destring inc_decoded, ignore("Less tha
> n LESS THAN Under,$ ") generate(acs_hinc_shp_ub) // parses out these words
  9.                                         gen acs_hinc_shp_lb = -100000
 10.                                         di "Lower bound of -100,000 created
>  for inc_level " `inc_level'
 11.                                 }
 12. 
.                         // text at end of the string:
.                                 else if regexm(inc_decoded, "[a-z/A-Z]+$") == 
> 1 {
 13.                                         di "The inc_level " `inc_level' " i
> s at the highest end of the original ACS income range"
 14.                                         // for upper-bound values, will mat
> ch if text at end of line
.                                         destring inc_decoded, ignore("and over
>  or over,$ or more OR MORE") generate(acs_hinc_shp_lb) // parses out these wor
> ds
 15.                                         gen acs_hinc_shp_ub = 999999  // my
>  topcode for asec purposes
 16.                                         di "Upper bound of 999999 created f
> or inc_level " `inc_level'
 17.                                 }
 18. 
.                         // if acs_hinc_shp is missing, keep it missing for low
> er_bound and upper_bound
.                                 else if regexm(inc_decoded, "[.][a-z]") == 1 {
 19.                                         di "The inc_level " `inc_level' " i
> s all missing"
 20.                                  // for missing values (a bit excessive, si
> nce already missing, but good to be sure)
.                                         gen acs_hinc_shp_lb = .
 21.                                         gen acs_hinc_shp_ub = .
 22.                                         di "Lower and upper bound of . crea
> ted for inc_level " `inc_level'
 23.                                 }
 24. 
.                         // for labels with 2 numbers in them
.                                 else if regexm(inc_decoded, "[0-9]+$") == 1 {
 25.                                 // regex "[0-9]+$" will match anything of f
> orm $0000 or 0000 at end of line -
.                                 // since those at lowest and highest ranges ha
> ve already been matched (using text), this leaves those with ranges
.                                                 di "The inc_level " `inc_level
> ' " has a lower and an upper level"
 26.                                                 split inc_decoded, ///
>                                                         parse("-" "to" "-" "to
>  under" "to less than" "UP TO" "but less than") ///
>                                                         ignore(" ,$") destring
 27.                                                 gen acs_hinc_shp_lb = inc_d
> ecoded1
 28.                                                 gen acs_hinc_shp_ub = inc_d
> ecoded2
 29.                                                 di "Lower bound of acs_hinc
> _shp_lb and upper bound of acs_hinc_shp_ub created for inc_level " `inc_level'
>  "of the original ACS income range"
 30.                                 }
 31. 
.                         // error - in case doesn't fit any existing category
.                                 else {
 32.                                         di "The inc_level " `inc_level' " d
> oes not fit any of the existing regular expressions designs."
 33.                                 }
 34. 
.                         // create locals to use later for selecting appropriat
> e ASEC bounds
.                                 local upper_bound = acs_hinc_shp_ub
 35.                                 local lower_bound = acs_hinc_shp_lb
 36. 
.                 // drop variables used in creating lower and upper bounds
.                         capture drop inc_decoded1 inc_decoded2
 37. 
.                 // #3A Now, still within the single-income-level loop in ACS d
> ataset:
. 
.                         // summarize so can get count of how many individuals 
> in that income level during year
.                                 quietly summarize if year == `y' & acs_hinc_sh
> p == `inc_level'
 38.                                 local sample_size = r(N) // count how many 
> rows there are in survey dataset
 39.                                   // count N_B for each bin (# of observati
> ons in ACS income category between L_bn and U_bn)
.                                 
.                                 // create count within each ACS income bin
.                                 gen acs_hinc_shp_n = `sample_size' // contains
>  size of bin in ACS dataset
 40.                                 label variable acs_hinc_shp_n "household (A
> CS) shp count of respondents in each income bin in original (research) dataset
> "
 41. 
. 
.                         // create temporary file of just this ACS income level
>  and year
.                                 keep if year == `y' & acs_hinc_shp == `inc_lev
> el'
 42.                                 tempfile premerge_`inc_level'_`y'
 43.                                 save `premerge_`inc_level'_`y'', replace
 44.                                 
.                                 *use $deriv/redi01_ASEC-hhincome.dta, clear //
>  use ASEC household dataset
.                                 use $temp/redi14_cps_state_ca.dta, clear // $t
> emp/redi14_cps_state_wy.dta
 45.                                 di "Calculating household income using hhin
> come ASEC variable."
 46. 
.                         // #3B) Takes a random draw of number of incomes w/in 
> that income boundary and year from the CPS-ASEC
.                         // Keep ASEC data if within income bounds and for give
> n year
. 
.                                 keep if year == `y' & ///
>                                         hhincome_asec >= `lower_bound' & ///
>                                         hhincome_asec <= `upper_bound'
 47.                                 gen obs_no = _n
 48.                                 save "$temp/redi03_ASEC-hhincome_year_inc`i
> nc_level'.dta", replace
 49.                                 di "Keep income between $`lower_bound' and 
> $`upper_bound' for `y' year."
 50.                         
.                         // #3C) Sample, with replacement, such that ASEC incom
> e has an equal 
.                         // probability assigned to each observation in this ar
> tificial data set 
.                         // (which will later be matched to ACS data set)
.                         // Thanks to Clyde Schechter; https://www.statalist.or
> g/forums/forum/general-stata-discussion/general/1475890-is-there-a-command-tha
> t-is-equivalent-to-bsample-more-than-_n
.                                 quietly des 
 51.                                 local N = r(N)
 52. 
.                                 clear
 53.                                 set obs `sample_size'
 54.                                 *set seed 1
. 
.                                 gen obs_no = runiformint(1, `N')
 55.                                 merge m:1 obs_no using "$temp/redi03_ASEC-h
> hincome_year_inc`inc_level'.dta", keep(match) nogenerate 
 56.                                                                            
>                              
.                         // #3D) Add new columns for lower_bound and upper_boun
> d of income bin
.                                 gen acs_hinc_shp_lb = `lower_bound'
 57.                                 gen acs_hinc_shp_ub = `upper_bound'
 58.                         // Label new upper and lower income bound variables
.                                 label variable acs_hinc_shp_lb "acs_hinc_shp L
> ower Bound"
 59.                                 label variable acs_hinc_shp_ub "acs_hinc_sh
> p Upper Bound"
 60. 
.                                 save "$temp/redi03_ASEC-hhincome_year_inc`inc_
> level'.dta", replace
 61.                                 
. 
.                         // #4) Merge ACS (using=premerge) and ASEC data (maste
> r) 
.                         // here, ASEC artificial datase (from step 3A) is matc
> hed 
.                         // to ACS for that incomebin for that year            
>                                                   
.                                 gen id = _n
 62.                                 merge 1:1 id using `premerge_`inc_level'_`y
> ''
 63.                                 
.                                 di "Merged ASEC values with original ACS datas
> et for inc_level " `inc_level' ///
>                                    " ($`lower_bound'-`upper_bound') and year `
> y'."
 64.                                                 
.                         // #5) create count within each REDI income bin
.                                 generate        redi_hinc_shp_n = .
 65.                                 replace         redi_hinc_shp_n = `N' // r(
> N) from above
 66.                                 label var       redi_hinc_shp_n "household 
> (REDI) shp count of respondents in each income bin in post-merge dataset'"
 67. 
.                         // Save these new redi data (with yearly ASEC continuo
> us data) in a tempfile we can use later for merging, etc.
.                                 tempfile temp_`inc_level'_`y'
 68.                                 save `temp_`inc_level'_`y'', replace
 69.                                 di "Saved REDI data (with ASEC continuous d
> ata) for inc_level " `inc_level' " ($`lower_bound'-`upper_bound') and year `y'
>  in file"
 70.                 
.                 }  //  close loop through all values of income categories (`in
> c_level')
 71.                                 
.                 di  in red "Moved outside loop of year income bracket " `inc_l
> evel' " ($`lower_bound'-`upper_bound')."
 72.                 
.                 // append all income brackets across all years
.                         tokenize `acs_hinc_shp_levels'
 73.                         local first `1'
 74.                         use `temp_`1'_`y'', clear
 75.                         macro shift
 76.                         local rest `*'
 77. 
.                 // now loop through and append each temp file created within i
> ncome bracket loop
.                         foreach bracket in `*' {
 78.                                 append using `temp_`bracket'_`y''
 79.                         }
 80. 
.                 // create new tempfile to save each year's data for all income
>  levels
.                         tempfile temp_`y'
 81.                         save `temp_`y'', replace
 82.                         di "Saved new tempfile  for year `y' for all REDI i
> ncome brackets."
 83. 
.                                                 
.         } //  end of loop through all years
(ACS data with artificial bins, CA 2019)
(362,110 observations deleted)
The current inc_level is: 1
The inc_level 1 is at the lowest end of the original ACS income range
inc_decoded: characters L e s space t h a n $ removed; acs_hinc_shp_ub generated
>  as int
Lower bound of -100,000 created for inc_level 1
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000002 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000002 saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,679 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc1.dta saved
Keep income between $-100000 and $15000 for 2019 year.
number of observations (_N) was 0, now 17,981

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,981  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc1.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,981  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 1 ($-100000-15000) an
> d year 2019.
(17,981 missing values generated)
(17,981 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000003 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000003 saved
Saved REDI data (with ASEC continuous data) for inc_level 1 ($-100000-15000) and
>  year 2019 in file
(ACS data with artificial bins, CA 2019)
(362,779 observations deleted)
The current inc_level is: 2
The inc_level 2 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as int
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 2of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000004 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000004 saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,775 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc2.dta saved
Keep income between $15000 and $25000 for 2019 year.
number of observations (_N) was 0, now 17,312

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,312  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc2.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,312  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 2 ($15000-25000) and 
> year 2019.
(17,312 missing values generated)
(17,312 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000005 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000005 saved
Saved REDI data (with ASEC continuous data) for inc_level 2 ($15000-25000) and y
> ear 2019 in file
(ACS data with artificial bins, CA 2019)
(360,497 observations deleted)
The current inc_level is: 3
The inc_level 3 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 3of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000006 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000006 saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,714 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc3.dta saved
Keep income between $25000 and $35000 for 2019 year.
number of observations (_N) was 0, now 19,594

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            19,594  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc3.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            19,594  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 3 ($25000-35000) and 
> year 2019.
(19,594 missing values generated)
(19,594 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000007 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000007 saved
Saved REDI data (with ASEC continuous data) for inc_level 3 ($25000-35000) and y
> ear 2019 in file
(ACS data with artificial bins, CA 2019)
(347,770 observations deleted)
The current inc_level is: 4
The inc_level 4 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 4of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000008 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000008 saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,519 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc4.dta saved
Keep income between $35000 and $50000 for 2019 year.
number of observations (_N) was 0, now 32,321

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            32,321  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc4.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            32,321  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 4 ($35000-50000) and 
> year 2019.
(32,321 missing values generated)
(32,321 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000009 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000009 saved
Saved REDI data (with ASEC continuous data) for inc_level 4 ($35000-50000) and y
> ear 2019 in file
(ACS data with artificial bins, CA 2019)
(328,388 observations deleted)
The current inc_level is: 5
The inc_level 5 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 5of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000a not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000a saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,240 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc5.dta saved
Keep income between $50000 and $75000 for 2019 year.
number of observations (_N) was 0, now 51,703

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            51,703  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc5.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            51,703  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 5 ($50000-75000) and 
> year 2019.
(51,703 missing values generated)
(51,703 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000b not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000b saved
Saved REDI data (with ASEC continuous data) for inc_level 5 ($50000-75000) and y
> ear 2019 in file
(ACS data with artificial bins, CA 2019)
(331,796 observations deleted)
The current inc_level is: 6
The inc_level 6 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 6of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000c not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000c saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,434 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc6.dta saved
Keep income between $75000 and $100000 for 2019 year.
number of observations (_N) was 0, now 48,295

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            48,295  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc6.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            48,295  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 6 ($75000-100000) and
>  year 2019.
(48,295 missing values generated)
(48,295 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000d not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000d saved
Saved REDI data (with ASEC continuous data) for inc_level 6 ($75000-100000) and 
> year 2019 in file
(ACS data with artificial bins, CA 2019)
(309,228 observations deleted)
The current inc_level is: 7
The inc_level 7 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 7of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000e not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000e saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,295 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc7.dta saved
Keep income between $100000 and $150000 for 2019 year.
number of observations (_N) was 0, now 70,863

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            70,863  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc7.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            70,863  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 7 ($100000-150000) an
> d year 2019.
(70,863 missing values generated)
(70,863 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000f not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000f saved
Saved REDI data (with ASEC continuous data) for inc_level 7 ($100000-150000) and
>  year 2019 in file
(ACS data with artificial bins, CA 2019)
(338,355 observations deleted)
The current inc_level is: 8
The inc_level 8 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 8of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000g not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000g saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,769 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc8.dta saved
Keep income between $150000 and $200000 for 2019 year.
number of observations (_N) was 0, now 41,736

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            41,736  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc8.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            41,736  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 8 ($150000-200000) an
> d year 2019.
(41,736 missing values generated)
(41,736 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000h not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000h saved
Saved REDI data (with ASEC continuous data) for inc_level 8 ($150000-200000) and
>  year 2019 in file
(ACS data with artificial bins, CA 2019)
(315,897 observations deleted)
The current inc_level is: 9
The inc_level 9 is at the highest end of the original ACS income range
inc_decoded: characters space o e r m removed; acs_hinc_shp_lb generated as long
Upper bound of 999999 created for inc_level 9
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000i not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000i saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,528 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc9.dta saved
Keep income between $200000 and $999999 for 2019 year.
number of observations (_N) was 0, now 64,194

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            64,194  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc9.dta saved
(note: variable acs_hinc_shp_lb was float, now double to accommodate using
       data's values)
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            64,194  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 9 ($200000-999999) an
> d year 2019.
(64,194 missing values generated)
(64,194 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000j not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000j saved
Saved REDI data (with ASEC continuous data) for inc_level 9 ($200000-999999) and
>  year 2019 in file
Moved outside loop of year income bracket  ($200000-999999).
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(note: variable acs_hinc_shp_lb was float, now double to accommodate using
       data's values)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000k not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000k saved
Saved new tempfile  for year 2019 for all REDI income brackets.

.                                 
.         // append all years 
.                 tokenize `years'

.                 local first `1'

.                 use `temp_`1'', clear

.                 macro shift

.                 local rest `*'

. 
.         // now loop through and append each yearly temp file created earlier
.                 foreach ytemp in `*' {
  2.                         append using `temp_`ytemp''
  3.                 }

.                 di "Appended all years "
Appended all years 

. 
. // CLEAN UP
. 
. sort year acs_hinc_shp id

. drop obs_no id inc_decoded

. 
. tab _merge

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
            matched (3) |    363,999      100.00      100.00
------------------------+-----------------------------------
                  Total |    363,999      100.00

. drop _merge

. 
. di in red "End of redi03a_categ_distrib.doi for household and shp variables" 
End of redi03a_categ_distrib.doi for household and shp variables

. 
. 
. // Clean Up
. keep if year == 2019
(0 observations deleted)

. drop gq sample serial cbserial countyfip age nchild whymove union  month

. svyset[pweight=perwt], vce(brr) brrweight(repwtp1-repwtp80) fay(.5)mse

      pweight: perwt
          VCE: brr
          MSE: on
    brrweight: repwtp1 .. repwtp80
          fay: .5
  Single unit: missing
     Strata 1: <one>
         SU 1: <observations>
        FPC 1: <zero>

. 
. rename  hhincome_asec redi_hinc 

. rename acs_hinc_shp acs_hinc

. order acs_hinc redi_hinc hhincome_acs acs_hinc_shp_lb acs_hinc_shp_ub 

. 
. // CREATE NATURAL LOG INCOME VARIABLES
. gen redi_hinc_ln = ln(redi_hinc)
(2,706 missing values generated)

. replace redi_hinc_ln = 0 if redi_hinc == 0
(2,608 real changes made)

. 
. gen acs_hinc_ln = ln(hhincome_acs)
(2,542 missing values generated)

. replace acs_hinc_ln = 0 if hhincome_acs <= 0
(2,542 real changes made)

. 
. // Save Data 
. label data "California 2019 ACS data converted to continuous REDI-calculated v
> alues"

. notes: redi13_REDI_Ca2019.dta \ ///
>         ACS hinc_shp Data converted to continuous REDI \ /// 
>         redi13_REDI_state_example.do  $S_DATE

. compress
  variable redi_hinc_shp_n was float now int
  variable acs_hinc_shp_lb was double now long
  (2,183,994 bytes saved)

. datasignature set, reset  
  363999:226(105185):4291289806:1584303561       (data signature reset)

. save $deriv/redi14_REDI_Ca2019.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_derv/redi14_REDI_Ca2019.dta 
> saved

. 
. di in red "Completed REDI conversions for California 2019 data" 
Completed REDI conversions for California 2019 data

. 
. 
. ***--------------------------***
. 
. capture log close redi14_REDI_state_dataprep

. exit

end of do-file


. do "/var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//SD04358.000000"

. capture log close redi14_REDI_state_dataprep

. log using $redi/redi14_REDI_state_dataprep.log, name(redi14_REDI_state_datapre
> p) replace text
--------------------------------------------------------------------------------
      name:  redi14_REDI_state_dataprep
       log:  /Users/mollymking/Documents/SocResearch/Dissertation/redi/redi14_RE
> DI_state_dataprep.log
  log type:  text
 opened on:   9 Nov 2021, 19:36:00

. 
. //      project:        REDI Methods Paper
. 
. //  task:       Creating state samples and REDI income for state example
. //  data:       CPS ASEC from IPUMS, available: https://cps.ipums.org/
. //                              ACS from IPUMS, available: https://usa.ipums.o
> rg/
. 
. //  github:     redi
. //  OSF:                https://osf.io/qmhe8/
. 
. //  author:     Molly King
. 
. display "$S_DATE  $S_TIME"
 9 Nov 2021  19:36:00

. 
. ***--------------------------***
. // # PROGRAM SETUP
. ***--------------------------***
. 
. version 16 // keeps program consistent for future replications

. set linesize 80

. clear all

. set more off

. set seed 1

. 
. ***--------------------------***
. // # CREATE CPS-ASEC STATE SELECTIONS
. ***--------------------------***
. 
. use $deriv/redi01_ASEC-hhincome_all.dta, clear
(CPS ASEC data - Household Income - 2016, 2017, 2019)

. keep if year == 2019
(139,441 observations deleted)

. drop serial county

. label data "Streamlined CPS ASEC data, 2019"

. save $temp/redi14_cps_state_example.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_exampl
> e.dta saved

. 
. keep if statefip == 6 // California
(62,085 observations deleted)

. label data "Streamlined CPS ASEC data, CA 2019"

. save $temp/redi14_cps_state_ca.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_ca.dta
>  saved

. 
. use $temp/redi14_cps_state_example.dta, clear
(Streamlined CPS ASEC data, 2019)

. keep if statefip == 56 // Wyoming
(67,426 observations deleted)

. label data "Streamlined CPS ASEC data, WY 2019"

. save $temp/redi14_cps_state_wy.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_wy.dta
>  saved

. 
. 
. ***--------------------------***
. // # PREP ACS RESEARCH DATASET
. ***--------------------------***
. 
. use $deriv/redi13_REDI_state_demvars.dta, clear
(ACS data with DEMOGRAPHIC VARIABLES)

. keep if year == 2019
(6,346,527 observations deleted)

. * Drop extraneous variables
. label data "Streamlined ACS data, 2019"

. datasignature set, reset 
  3239553:209(55251):1894994316:673242353       (data signature reset)

. 
. *arbitrary categories invented to demonstrate flexibility of method
. label define cat_inc                            ///
>         1       "Less than $15000"                              ///
>         2       "15000 to less than 25000"              ///
>         3       "25000 to less than 35000"              ///
>         4       "35000 to less than 50000"              ///
>         5       "50000 to less than 75000"              ///
>         6       "75000 to less than 100000"     ///
>         7       "100000 to less than 150000"    ///
>         8       "150000 to less than 200000"    ///
>         9       "200000 or more"                                //

.         
. gen     acs_hhinc = .
(3,239,553 missing values generated)

. replace acs_hhinc = 1 if hhincome_acs                                         
>      <= 15000
(190,626 real changes made)

. replace acs_hhinc = 2 if hhincome_acs  > 15000  & hhincome_acs <= 25000
(182,072 real changes made)

. replace acs_hhinc = 3 if hhincome_acs  > 25000  & hhincome_acs <= 35000
(205,123 real changes made)

. replace acs_hhinc = 4 if hhincome_acs  > 35000  & hhincome_acs <= 50000 
(332,557 real changes made)

. replace acs_hhinc = 5 if hhincome_acs  > 50000  & hhincome_acs <= 75000 
(522,013 real changes made)

. replace acs_hhinc = 6 if hhincome_acs  > 75000  & hhincome_acs <= 100000
(444,753 real changes made)

. replace acs_hhinc = 7 if hhincome_acs  > 100000 & hhincome_acs <= 150000 
(574,195 real changes made)

. replace acs_hhinc = 8 if hhincome_acs  > 150000 & hhincome_acs <= 200000
(280,282 real changes made)

. replace acs_hhinc = 9 if hhincome_acs  > 200000 & hhincome_acs != 9999999 
(356,611 real changes made)

. replace acs_hhinc = . if hhincome_acs == 9999999 
(0 real changes made)

. replace acs_hhinc = . if hhincome_acs == .
(0 real changes made)

. 
. label values acs_hhinc cat_inc

. label var acs_hhinc "Household Income (ACS) arbitrary categories based on hhin
> come_acs"

. notes acs_hhinc: ACS Household Income Categories from hhincome_acs \ $S_DATE

. 
. tab acs_hhinc, m

    Household Income (ACS) |
arbitrary categories based |
           on hhincome_acs |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
          Less than $15000 |    190,626        5.88        5.88
  15000 to less than 25000 |    182,072        5.62       11.50
  25000 to less than 35000 |    205,123        6.33       17.84
  35000 to less than 50000 |    332,557       10.27       28.10
  50000 to less than 75000 |    522,013       16.11       44.22
 75000 to less than 100000 |    444,753       13.73       57.94
100000 to less than 150000 |    574,195       17.72       75.67
150000 to less than 200000 |    280,282        8.65       84.32
            200000 or more |    356,611       11.01       95.33
                         . |    151,321        4.67      100.00
---------------------------+-----------------------------------
                     Total |  3,239,553      100.00

. *tab acs_hhinc, m nolab
. 
. save $temp/redi14_ACS2019.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_ACS2019.dta save
> d

. 
. ***--------------------------***
. // # CREATE ACS STATE SELECTIONS
. ***--------------------------***
. 
. use $temp/redi14_ACS2019.dta, clear
(Streamlined ACS data, 2019)

. keep if statefip == 6 // California
(2,859,462 observations deleted)

. label data "ACS data with artificial bins, CA 2019"

. save $temp/redi14_ACS2019CA.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_ACS2019CA.dta sa
> ved

. 
. use $temp/redi14_ACS2019.dta, clear
(Streamlined ACS data, 2019)

. keep if statefip == 56 // Wyoming
(3,233,586 observations deleted)

. label data "ACS data with artificial bins, WY 2019"

. save $temp/redi14_ACS2019WY.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_ACS2019WY.dta sa
> ved

. 
. 
. ***--------------------------***
. // # COMPLETE REDI CONVERSIONS ON 2019 Wyoming  DATA
. ***--------------------------***
. * cps_reference "$temp/redi14_cps_state_wy"
. * change line 125 in redi03a_categ_distrib to "use $temp/redi13_cps_state_wy.d
> ta, clear"
. 
. *year of conversion factor
. local year "year"

. 
. use $temp/redi14_ACS2019WY.dta, clear
(ACS data with artificial bins, WY 2019)

. 
. // Income Conversions
. rename acs_hhinc acs_hinc_shp

. include $redi/redi03a_categ_distrib.doi

. *! Include file to convert categorical to continuous income values, independen
> t of values of categories
. *! creates numeric variables indicating edges of income categories,
. *! and draws random continuous income from CPS-ASEC from between those edges
. 
. *! version 4.0 \ molly king 2020-08-25
. 
. ***--------------------------***
. 
. // #1 SETUP
.         *noisily
.         *set seed 1 // when commented out - selection from CPS-ASEC is random
.         compress
  variable countyfip was int now byte
  variable dB_fem was float now byte
  variable hisp was float now byte
  variable dB_rwhite was float now byte
  variable dB_rblack was float now byte
  variable dB_rasian was float now byte
  variable dB_rhisp was float now byte
  variable dB_rother was float now byte
  variable dG_race was float now byte
  variable dG_edu was float now byte
  variable dB_edu_lHS was float now byte
  variable dB_edu_HS was float now byte
  variable dB_edu_sCol was float now byte
  variable dB_edu_col was float now byte
  variable dB_edu_grad was float now byte
  variable dB_edu_colp was float now byte
  variable disability was float now byte
  variable married was float now byte
  variable ownhouse was float now byte
  variable migrate was float now byte
  variable acs_hinc_shp was float now byte
  (363,987 bytes saved)

. 
.         cd $temp
/Users/mollymking/Documents/SocResearch/Dissertation/data/data_temp

.         
.         //Create local for levels of income = e.g., levelsof year, local(years
> )
.         levelsof acs_hinc_shp, local("acs_hinc_shp_levels")
1 2 3 4 5 6 7 8 9

. 
.         // sort for later join & create variable recording the original observ
> ation order within the identifier
.         *bysort year acs_hinc_shp: gen year_inc_id = _n
.         bysort year acs_hinc_shp: gen id = _n

. 
. // #2 create numeric variables indicating edges of income categories //
.         // Note: for more detail on if-command and Stata regular expressions u
> sed to create this, see:
.                 *http://www.stata.com/statalist/archive/2013-03/msg00654.html
.                 *http://www.stata.com/support/faqs/programming/if-command-vers
> us-if-qualifier/
.                 *http://stats.idre.ucla.edu/stata/faq/how-can-i-extract-a-port
> ion-of-a-string-variable-using-regular-expressions/
. 
.         // List income levels
.         di in red "The income levels are: " "`acs_hinc_shp_levels'"
The income levels are: 1 2 3 4 5 6 7 8 9

. 
.         * Decode converts labels to string variables for acs_hinc_shp
.         decode acs_hinc_shp, gen(inc_decoded)

. 
.         tempfile working_regex

.         save `working_regex', replace
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000001 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000001 saved

. 
.         
.         //Levels of year variable to loop through years in dataset
.         levelsof year, local(years)
2019

.         di in red  "Create local variable years to loop through within that in
> come bracket - values:" `years'
Create local variable years to loop through within that income bracket - values:
> 2019

. 
.         foreach y of local years { // loop through all years
  2. 
.         
.                 // loop through all values of income categories (`inc_level')
.                 foreach inc_level of local acs_hinc_shp_levels {
  3. 
.                         use `working_regex', clear
  4. 
.                         // Keep the data if the income variable is equal to th
> e current income level (of the loop)
.                         keep if acs_hinc_shp == `inc_level'  // do this to mak
> e sure not replacing things with wrong level later
  5.                         di "The current inc_level is: " `inc_level'
  6. 
.                         // text at beginning of the string:
.                                 if regexm(inc_decoded, "^[a-z/A-Z]+") == 1 {
  7.                                         di "The inc_level " `inc_level' " i
> s at the lowest end of the original ACS income range"
  8.                                         // for lower-bound values, will mat
> ch if text at beginning of line
.                                         destring inc_decoded, ignore("Less tha
> n LESS THAN Under,$ ") generate(acs_hinc_shp_ub) // parses out these words
  9.                                         gen acs_hinc_shp_lb = -100000
 10.                                         di "Lower bound of -100,000 created
>  for inc_level " `inc_level'
 11.                                 }
 12. 
.                         // text at end of the string:
.                                 else if regexm(inc_decoded, "[a-z/A-Z]+$") == 
> 1 {
 13.                                         di "The inc_level " `inc_level' " i
> s at the highest end of the original ACS income range"
 14.                                         // for upper-bound values, will mat
> ch if text at end of line
.                                         destring inc_decoded, ignore("and over
>  or over,$ or more OR MORE") generate(acs_hinc_shp_lb) // parses out these wor
> ds
 15.                                         gen acs_hinc_shp_ub = 999999  // my
>  topcode for asec purposes
 16.                                         di "Upper bound of 999999 created f
> or inc_level " `inc_level'
 17.                                 }
 18. 
.                         // if acs_hinc_shp is missing, keep it missing for low
> er_bound and upper_bound
.                                 else if regexm(inc_decoded, "[.][a-z]") == 1 {
 19.                                         di "The inc_level " `inc_level' " i
> s all missing"
 20.                                  // for missing values (a bit excessive, si
> nce already missing, but good to be sure)
.                                         gen acs_hinc_shp_lb = .
 21.                                         gen acs_hinc_shp_ub = .
 22.                                         di "Lower and upper bound of . crea
> ted for inc_level " `inc_level'
 23.                                 }
 24. 
.                         // for labels with 2 numbers in them
.                                 else if regexm(inc_decoded, "[0-9]+$") == 1 {
 25.                                 // regex "[0-9]+$" will match anything of f
> orm $0000 or 0000 at end of line -
.                                 // since those at lowest and highest ranges ha
> ve already been matched (using text), this leaves those with ranges
.                                                 di "The inc_level " `inc_level
> ' " has a lower and an upper level"
 26.                                                 split inc_decoded, ///
>                                                         parse("-" "to" "-" "to
>  under" "to less than" "UP TO" "but less than") ///
>                                                         ignore(" ,$") destring
 27.                                                 gen acs_hinc_shp_lb = inc_d
> ecoded1
 28.                                                 gen acs_hinc_shp_ub = inc_d
> ecoded2
 29.                                                 di "Lower bound of acs_hinc
> _shp_lb and upper bound of acs_hinc_shp_ub created for inc_level " `inc_level'
>  "of the original ACS income range"
 30.                                 }
 31. 
.                         // error - in case doesn't fit any existing category
.                                 else {
 32.                                         di "The inc_level " `inc_level' " d
> oes not fit any of the existing regular expressions designs."
 33.                                 }
 34. 
.                         // create locals to use later for selecting appropriat
> e ASEC bounds
.                                 local upper_bound = acs_hinc_shp_ub
 35.                                 local lower_bound = acs_hinc_shp_lb
 36. 
.                 // drop variables used in creating lower and upper bounds
.                         capture drop inc_decoded1 inc_decoded2
 37. 
.                 // #3A Now, still within the single-income-level loop in ACS d
> ataset:
. 
.                         // summarize so can get count of how many individuals 
> in that income level during year
.                                 quietly summarize if year == `y' & acs_hinc_sh
> p == `inc_level'
 38.                                 local sample_size = r(N) // count how many 
> rows there are in survey dataset
 39.                                   // count N_B for each bin (# of observati
> ons in ACS income category between L_bn and U_bn)
.                                 
.                                 // create count within each ACS income bin
.                                 gen acs_hinc_shp_n = `sample_size' // contains
>  size of bin in ACS dataset
 40.                                 label variable acs_hinc_shp_n "household (A
> CS) shp count of respondents in each income bin in original (research) dataset
> "
 41. 
. 
.                         // create temporary file of just this ACS income level
>  and year
.                                 keep if year == `y' & acs_hinc_shp == `inc_lev
> el'
 42.                                 tempfile premerge_`inc_level'_`y'
 43.                                 save `premerge_`inc_level'_`y'', replace
 44.                                 
.                                 *use $deriv/redi01_ASEC-hhincome.dta, clear //
>  use ASEC household dataset
.                                 use $temp/redi14_cps_state_wy.dta, clear // $t
> emp/redi14_cps_state_wy.dta
 45.                                 di "Calculating household income using hhin
> come ASEC variable."
 46. 
.                         // #3B) Takes a random draw of number of incomes w/in 
> that income boundary and year from the CPS-ASEC
.                         // Keep ASEC data if within income bounds and for give
> n year
. 
.                                 keep if year == `y' & ///
>                                         hhincome_asec >= `lower_bound' & ///
>                                         hhincome_asec <= `upper_bound'
 47.                                 gen obs_no = _n
 48.                                 save "$temp/redi03_ASEC-hhincome_year_inc`i
> nc_level'.dta", replace
 49.                                 di "Keep income between $`lower_bound' and 
> $`upper_bound' for `y' year."
 50.                         
.                         // #3C) Sample, with replacement, such that ASEC incom
> e has an equal 
.                         // probability assigned to each observation in this ar
> tificial data set 
.                         // (which will later be matched to ACS data set)
.                         // Thanks to Clyde Schechter; https://www.statalist.or
> g/forums/forum/general-stata-discussion/general/1475890-is-there-a-command-tha
> t-is-equivalent-to-bsample-more-than-_n
.                                 quietly des 
 51.                                 local N = r(N)
 52. 
.                                 clear
 53.                                 set obs `sample_size'
 54.                                 *set seed 1
. 
.                                 gen obs_no = runiformint(1, `N')
 55.                                 merge m:1 obs_no using "$temp/redi03_ASEC-h
> hincome_year_inc`inc_level'.dta", keep(match) nogenerate 
 56.                                                                            
>                              
.                         // #3D) Add new columns for lower_bound and upper_boun
> d of income bin
.                                 gen acs_hinc_shp_lb = `lower_bound'
 57.                                 gen acs_hinc_shp_ub = `upper_bound'
 58.                         // Label new upper and lower income bound variables
.                                 label variable acs_hinc_shp_lb "acs_hinc_shp L
> ower Bound"
 59.                                 label variable acs_hinc_shp_ub "acs_hinc_sh
> p Upper Bound"
 60. 
.                                 save "$temp/redi03_ASEC-hhincome_year_inc`inc_
> level'.dta", replace
 61.                                 
. 
.                         // #4) Merge ACS (using=premerge) and ASEC data (maste
> r) 
.                         // here, ASEC artificial datase (from step 3A) is matc
> hed 
.                         // to ACS for that incomebin for that year            
>                                                   
.                                 gen id = _n
 62.                                 merge 1:1 id using `premerge_`inc_level'_`y
> ''
 63.                                 
.                                 di "Merged ASEC values with original ACS datas
> et for inc_level " `inc_level' ///
>                                    " ($`lower_bound'-`upper_bound') and year `
> y'."
 64.                                                 
.                         // #5) create count within each REDI income bin
.                                 generate        redi_hinc_shp_n = .
 65.                                 replace         redi_hinc_shp_n = `N' // r(
> N) from above
 66.                                 label var       redi_hinc_shp_n "household 
> (REDI) shp count of respondents in each income bin in post-merge dataset'"
 67. 
.                         // Save these new redi data (with yearly ASEC continuo
> us data) in a tempfile we can use later for merging, etc.
.                                 tempfile temp_`inc_level'_`y'
 68.                                 save `temp_`inc_level'_`y'', replace
 69.                                 di "Saved REDI data (with ASEC continuous d
> ata) for inc_level " `inc_level' " ($`lower_bound'-`upper_bound') and year `y'
>  in file"
 70.                 
.                 }  //  close loop through all values of income categories (`in
> c_level')
 71.                                 
.                 di  in red "Moved outside loop of year income bracket " `inc_l
> evel' " ($`lower_bound'-`upper_bound')."
 72.                 
.                 // append all income brackets across all years
.                         tokenize `acs_hinc_shp_levels'
 73.                         local first `1'
 74.                         use `temp_`1'_`y'', clear
 75.                         macro shift
 76.                         local rest `*'
 77. 
.                 // now loop through and append each temp file created within i
> ncome bracket loop
.                         foreach bracket in `*' {
 78.                                 append using `temp_`bracket'_`y''
 79.                         }
 80. 
.                 // create new tempfile to save each year's data for all income
>  levels
.                         tempfile temp_`y'
 81.                         save `temp_`y'', replace
 82.                         di "Saved new tempfile  for year `y' for all REDI i
> ncome brackets."
 83. 
.                                                 
.         } //  end of loop through all years
(ACS data with artificial bins, WY 2019)
(5,640 observations deleted)
The current inc_level is: 1
The inc_level 1 is at the lowest end of the original ACS income range
inc_decoded: characters L e s space t h a n $ removed; acs_hinc_shp_ub generated
>  as int
Lower bound of -100,000 created for inc_level 1
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000002 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000002 saved
(Streamlined CPS ASEC data, WY 2019)
Calculating household income using hhincome ASEC variable.
(845 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc1.dta saved
Keep income between $-100000 and $15000 for 2019 year.
number of observations (_N) was 0, now 327

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               327  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc1.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               327  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 1 ($-100000-15000) an
> d year 2019.
(327 missing values generated)
(327 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000003 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000003 saved
Saved REDI data (with ASEC continuous data) for inc_level 1 ($-100000-15000) and
>  year 2019 in file
(ACS data with artificial bins, WY 2019)
(5,625 observations deleted)
The current inc_level is: 2
The inc_level 2 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as int
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 2of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000004 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000004 saved
(Streamlined CPS ASEC data, WY 2019)
Calculating household income using hhincome ASEC variable.
(840 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc2.dta saved
Keep income between $15000 and $25000 for 2019 year.
number of observations (_N) was 0, now 342

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               342  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc2.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               342  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 2 ($15000-25000) and 
> year 2019.
(342 missing values generated)
(342 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000005 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000005 saved
Saved REDI data (with ASEC continuous data) for inc_level 2 ($15000-25000) and y
> ear 2019 in file
(ACS data with artificial bins, WY 2019)
(5,597 observations deleted)
The current inc_level is: 3
The inc_level 3 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 3of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000006 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000006 saved
(Streamlined CPS ASEC data, WY 2019)
Calculating household income using hhincome ASEC variable.
(829 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc3.dta saved
Keep income between $25000 and $35000 for 2019 year.
number of observations (_N) was 0, now 370

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               370  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc3.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               370  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 3 ($25000-35000) and 
> year 2019.
(370 missing values generated)
(370 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000007 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000007 saved
Saved REDI data (with ASEC continuous data) for inc_level 3 ($25000-35000) and y
> ear 2019 in file
(ACS data with artificial bins, WY 2019)
(5,343 observations deleted)
The current inc_level is: 4
The inc_level 4 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 4of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000008 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000008 saved
(Streamlined CPS ASEC data, WY 2019)
Calculating household income using hhincome ASEC variable.
(808 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc4.dta saved
Keep income between $35000 and $50000 for 2019 year.
number of observations (_N) was 0, now 624

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               624  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc4.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               624  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 4 ($35000-50000) and 
> year 2019.
(624 missing values generated)
(624 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000009 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000009 saved
Saved REDI data (with ASEC continuous data) for inc_level 4 ($35000-50000) and y
> ear 2019 in file
(ACS data with artificial bins, WY 2019)
(4,839 observations deleted)
The current inc_level is: 5
The inc_level 5 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 5of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000a not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000a saved
(Streamlined CPS ASEC data, WY 2019)
Calculating household income using hhincome ASEC variable.
(742 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc5.dta saved
Keep income between $50000 and $75000 for 2019 year.
number of observations (_N) was 0, now 1,128

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,128  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc5.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,128  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 5 ($50000-75000) and 
> year 2019.
(1,128 missing values generated)
(1,128 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000b not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000b saved
Saved REDI data (with ASEC continuous data) for inc_level 5 ($50000-75000) and y
> ear 2019 in file
(ACS data with artificial bins, WY 2019)
(4,931 observations deleted)
The current inc_level is: 6
The inc_level 6 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 6of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000c not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000c saved
(Streamlined CPS ASEC data, WY 2019)
Calculating household income using hhincome ASEC variable.
(796 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc6.dta saved
Keep income between $75000 and $100000 for 2019 year.
number of observations (_N) was 0, now 1,036

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,036  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc6.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,036  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 6 ($75000-100000) and
>  year 2019.
(1,036 missing values generated)
(1,036 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000d not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000d saved
Saved REDI data (with ASEC continuous data) for inc_level 6 ($75000-100000) and 
> year 2019 in file
(ACS data with artificial bins, WY 2019)
(4,829 observations deleted)
The current inc_level is: 7
The inc_level 7 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 7of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000e not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000e saved
(Streamlined CPS ASEC data, WY 2019)
Calculating household income using hhincome ASEC variable.
(756 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc7.dta saved
Keep income between $100000 and $150000 for 2019 year.
number of observations (_N) was 0, now 1,138

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,138  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc7.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,138  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 7 ($100000-150000) an
> d year 2019.
(1,138 missing values generated)
(1,138 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000f not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000f saved
Saved REDI data (with ASEC continuous data) for inc_level 7 ($100000-150000) and
>  year 2019 in file
(ACS data with artificial bins, WY 2019)
(5,496 observations deleted)
The current inc_level is: 8
The inc_level 8 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 8of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000g not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000g saved
(Streamlined CPS ASEC data, WY 2019)
Calculating household income using hhincome ASEC variable.
(857 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc8.dta saved
Keep income between $150000 and $200000 for 2019 year.
number of observations (_N) was 0, now 471

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               471  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc8.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               471  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 8 ($150000-200000) an
> d year 2019.
(471 missing values generated)
(471 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000h not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000h saved
Saved REDI data (with ASEC continuous data) for inc_level 8 ($150000-200000) and
>  year 2019 in file
(ACS data with artificial bins, WY 2019)
(5,622 observations deleted)
The current inc_level is: 9
The inc_level 9 is at the highest end of the original ACS income range
inc_decoded: characters space o e r m removed; acs_hinc_shp_lb generated as long
Upper bound of 999999 created for inc_level 9
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000i not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000i saved
(Streamlined CPS ASEC data, WY 2019)
Calculating household income using hhincome ASEC variable.
(869 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc9.dta saved
Keep income between $200000 and $999999 for 2019 year.
number of observations (_N) was 0, now 345

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               345  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc9.dta saved
(note: variable acs_hinc_shp_lb was float, now double to accommodate using
       data's values)
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               345  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 9 ($200000-999999) an
> d year 2019.
(345 missing values generated)
(345 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000j not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000j saved
Saved REDI data (with ASEC continuous data) for inc_level 9 ($200000-999999) and
>  year 2019 in file
Moved outside loop of year income bracket  ($200000-999999).
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(note: variable acs_hinc_shp_lb was float, now double to accommodate using
       data's values)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000k not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000k saved
Saved new tempfile  for year 2019 for all REDI income brackets.

.                                 
.         // append all years 
.                 tokenize `years'

.                 local first `1'

.                 use `temp_`1'', clear

.                 macro shift

.                 local rest `*'

. 
.         // now loop through and append each yearly temp file created earlier
.                 foreach ytemp in `*' {
  2.                         append using `temp_`ytemp''
  3.                 }

.                 di "Appended all years "
Appended all years 

. 
. // CLEAN UP
. 
. sort year acs_hinc_shp id

. drop obs_no id inc_decoded

. 
. tab _merge

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
            matched (3) |      5,781      100.00      100.00
------------------------+-----------------------------------
                  Total |      5,781      100.00

. drop _merge

. 
. di in red "End of redi03a_categ_distrib.doi for household and shp variables" 
End of redi03a_categ_distrib.doi for household and shp variables

. 
. 
. // Clean Up
. keep if year == 2019
(0 observations deleted)

. drop gq sample serial cbserial countyfip age nchild whymove union  month

. svyset[pweight=perwt], vce(brr) brrweight(repwtp1-repwtp80) fay(.5)mse

      pweight: perwt
          VCE: brr
          MSE: on
    brrweight: repwtp1 .. repwtp80
          fay: .5
  Single unit: missing
     Strata 1: <one>
         SU 1: <observations>
        FPC 1: <zero>

. 
. rename hhincome_asec redi_hinc 

. rename acs_hinc_shp acs_hinc

. order acs_hinc redi_hinc hhincome_acs acs_hinc_shp_lb acs_hinc_shp_ub 

. 
. 
. // CREATE NATURAL LOG INCOME VARIABLES
. gen redi_hinc_ln = ln(redi_hinc)
(27 missing values generated)

. replace redi_hinc_ln = 0 if redi_hinc == 0
(27 real changes made)

. 
. gen acs_hinc_ln = ln(hhincome_acs)
(30 missing values generated)

. replace acs_hinc_ln = 0 if hhincome_acs == 0
(29 real changes made)

. 
. // Save Data 
. label data "Wyoming 2019 ACS data converted to continuous REDI-calculated valu
> es"

. notes: redi13_REDI_Wy2019.dta \ ///
>         ACS hinc_shp Data converted to continuous REDI \ /// 
>         redi13_REDI_state_example.do  $S_DATE

. 
. compress
  variable acs_hinc_shp_n was float now int
  variable redi_hinc_shp_n was float now int
  variable acs_hinc_shp_lb was double now long
  (46,248 bytes saved)

. datasignature set, reset  
  5781:226(105185):3487359136:3190443858       (data signature reset)

. save $deriv/redi14_REDI_Wy2019.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_derv/redi14_REDI_Wy2019.dta 
> saved

. 
. di in red "Completed REDI conversions for Wyoming 2019 data" 
Completed REDI conversions for Wyoming 2019 data

. 
end of do-file

. do "/var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//SD04358.000000"

. 
. ***--------------------------***
. // # COMPLETE REDI CONVERSIONS ON 2019 California  DATA
. ***--------------------------***
. * cps_reference "$temp/redi14_cps_state_ca"
. * change line 125 in redi03a_categ_distrib to "use $temp/redi13_cps_state_ca.d
> ta, clear"
. 
. *year of conversion factor
. local year "year"

. 
. use $temp/redi14_ACS2019CA.dta, clear
(ACS data with artificial bins, CA 2019)

. 
. // Income Conversions
. rename acs_hhinc acs_hinc_shp

. include $redi/redi03a_categ_distrib.doi

. *! Include file to convert categorical to continuous income values, independen
> t of values of categories
. *! creates numeric variables indicating edges of income categories,
. *! and draws random continuous income from CPS-ASEC from between those edges
. 
. *! version 4.0 \ molly king 2020-08-25
. 
. ***--------------------------***
. 
. // #1 SETUP
.         *noisily
.         *set seed 1 // when commented out - selection from CPS-ASEC is random
.         compress
  variable dB_fem was float now byte
  variable hisp was float now byte
  variable dB_rwhite was float now byte
  variable dB_rblack was float now byte
  variable dB_rasian was float now byte
  variable dB_rhisp was float now byte
  variable dB_rother was float now byte
  variable dG_race was float now byte
  variable dG_edu was float now byte
  variable dB_edu_lHS was float now byte
  variable dB_edu_HS was float now byte
  variable dB_edu_sCol was float now byte
  variable dB_edu_col was float now byte
  variable dB_edu_grad was float now byte
  variable dB_edu_colp was float now byte
  variable disability was float now byte
  variable married was float now byte
  variable ownhouse was float now byte
  variable migrate was float now byte
  variable acs_hinc_shp was float now byte
  (22,805,460 bytes saved)

. 
.         cd $temp
/Users/mollymking/Documents/SocResearch/Dissertation/data/data_temp

.         
.         //Create local for levels of income = e.g., levelsof year, local(years
> )
.         levelsof acs_hinc_shp, local("acs_hinc_shp_levels")
1 2 3 4 5 6 7 8 9

. 
.         // sort for later join & create variable recording the original observ
> ation order within the identifier
.         *bysort year acs_hinc_shp: gen year_inc_id = _n
.         bysort year acs_hinc_shp: gen id = _n

. 
. // #2 create numeric variables indicating edges of income categories //
.         // Note: for more detail on if-command and Stata regular expressions u
> sed to create this, see:
.                 *http://www.stata.com/statalist/archive/2013-03/msg00654.html
.                 *http://www.stata.com/support/faqs/programming/if-command-vers
> us-if-qualifier/
.                 *http://stats.idre.ucla.edu/stata/faq/how-can-i-extract-a-port
> ion-of-a-string-variable-using-regular-expressions/
. 
.         // List income levels
.         di in red "The income levels are: " "`acs_hinc_shp_levels'"
The income levels are: 1 2 3 4 5 6 7 8 9

. 
.         * Decode converts labels to string variables for acs_hinc_shp
.         decode acs_hinc_shp, gen(inc_decoded)

. 
.         tempfile working_regex

.         save `working_regex', replace
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000001 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000001 saved

. 
.         
.         //Levels of year variable to loop through years in dataset
.         levelsof year, local(years)
2019

.         di in red  "Create local variable years to loop through within that in
> come bracket - values:" `years'
Create local variable years to loop through within that income bracket - values:
> 2019

. 
.         foreach y of local years { // loop through all years
  2. 
.         
.                 // loop through all values of income categories (`inc_level')
.                 foreach inc_level of local acs_hinc_shp_levels {
  3. 
.                         use `working_regex', clear
  4. 
.                         // Keep the data if the income variable is equal to th
> e current income level (of the loop)
.                         keep if acs_hinc_shp == `inc_level'  // do this to mak
> e sure not replacing things with wrong level later
  5.                         di "The current inc_level is: " `inc_level'
  6. 
.                         // text at beginning of the string:
.                                 if regexm(inc_decoded, "^[a-z/A-Z]+") == 1 {
  7.                                         di "The inc_level " `inc_level' " i
> s at the lowest end of the original ACS income range"
  8.                                         // for lower-bound values, will mat
> ch if text at beginning of line
.                                         destring inc_decoded, ignore("Less tha
> n LESS THAN Under,$ ") generate(acs_hinc_shp_ub) // parses out these words
  9.                                         gen acs_hinc_shp_lb = -100000
 10.                                         di "Lower bound of -100,000 created
>  for inc_level " `inc_level'
 11.                                 }
 12. 
.                         // text at end of the string:
.                                 else if regexm(inc_decoded, "[a-z/A-Z]+$") == 
> 1 {
 13.                                         di "The inc_level " `inc_level' " i
> s at the highest end of the original ACS income range"
 14.                                         // for upper-bound values, will mat
> ch if text at end of line
.                                         destring inc_decoded, ignore("and over
>  or over,$ or more OR MORE") generate(acs_hinc_shp_lb) // parses out these wor
> ds
 15.                                         gen acs_hinc_shp_ub = 999999  // my
>  topcode for asec purposes
 16.                                         di "Upper bound of 999999 created f
> or inc_level " `inc_level'
 17.                                 }
 18. 
.                         // if acs_hinc_shp is missing, keep it missing for low
> er_bound and upper_bound
.                                 else if regexm(inc_decoded, "[.][a-z]") == 1 {
 19.                                         di "The inc_level " `inc_level' " i
> s all missing"
 20.                                  // for missing values (a bit excessive, si
> nce already missing, but good to be sure)
.                                         gen acs_hinc_shp_lb = .
 21.                                         gen acs_hinc_shp_ub = .
 22.                                         di "Lower and upper bound of . crea
> ted for inc_level " `inc_level'
 23.                                 }
 24. 
.                         // for labels with 2 numbers in them
.                                 else if regexm(inc_decoded, "[0-9]+$") == 1 {
 25.                                 // regex "[0-9]+$" will match anything of f
> orm $0000 or 0000 at end of line -
.                                 // since those at lowest and highest ranges ha
> ve already been matched (using text), this leaves those with ranges
.                                                 di "The inc_level " `inc_level
> ' " has a lower and an upper level"
 26.                                                 split inc_decoded, ///
>                                                         parse("-" "to" "-" "to
>  under" "to less than" "UP TO" "but less than") ///
>                                                         ignore(" ,$") destring
 27.                                                 gen acs_hinc_shp_lb = inc_d
> ecoded1
 28.                                                 gen acs_hinc_shp_ub = inc_d
> ecoded2
 29.                                                 di "Lower bound of acs_hinc
> _shp_lb and upper bound of acs_hinc_shp_ub created for inc_level " `inc_level'
>  "of the original ACS income range"
 30.                                 }
 31. 
.                         // error - in case doesn't fit any existing category
.                                 else {
 32.                                         di "The inc_level " `inc_level' " d
> oes not fit any of the existing regular expressions designs."
 33.                                 }
 34. 
.                         // create locals to use later for selecting appropriat
> e ASEC bounds
.                                 local upper_bound = acs_hinc_shp_ub
 35.                                 local lower_bound = acs_hinc_shp_lb
 36. 
.                 // drop variables used in creating lower and upper bounds
.                         capture drop inc_decoded1 inc_decoded2
 37. 
.                 // #3A Now, still within the single-income-level loop in ACS d
> ataset:
. 
.                         // summarize so can get count of how many individuals 
> in that income level during year
.                                 quietly summarize if year == `y' & acs_hinc_sh
> p == `inc_level'
 38.                                 local sample_size = r(N) // count how many 
> rows there are in survey dataset
 39.                                   // count N_B for each bin (# of observati
> ons in ACS income category between L_bn and U_bn)
.                                 
.                                 // create count within each ACS income bin
.                                 gen acs_hinc_shp_n = `sample_size' // contains
>  size of bin in ACS dataset
 40.                                 label variable acs_hinc_shp_n "household (A
> CS) shp count of respondents in each income bin in original (research) dataset
> "
 41. 
. 
.                         // create temporary file of just this ACS income level
>  and year
.                                 keep if year == `y' & acs_hinc_shp == `inc_lev
> el'
 42.                                 tempfile premerge_`inc_level'_`y'
 43.                                 save `premerge_`inc_level'_`y'', replace
 44.                                 
.                                 *use $deriv/redi01_ASEC-hhincome.dta, clear //
>  use ASEC household dataset
.                                 use $temp/redi14_cps_state_ca.dta, clear // $t
> emp/redi14_cps_state_wy.dta
 45.                                 di "Calculating household income using hhin
> come ASEC variable."
 46. 
.                         // #3B) Takes a random draw of number of incomes w/in 
> that income boundary and year from the CPS-ASEC
.                         // Keep ASEC data if within income bounds and for give
> n year
. 
.                                 keep if year == `y' & ///
>                                         hhincome_asec >= `lower_bound' & ///
>                                         hhincome_asec <= `upper_bound'
 47.                                 gen obs_no = _n
 48.                                 save "$temp/redi03_ASEC-hhincome_year_inc`i
> nc_level'.dta", replace
 49.                                 di "Keep income between $`lower_bound' and 
> $`upper_bound' for `y' year."
 50.                         
.                         // #3C) Sample, with replacement, such that ASEC incom
> e has an equal 
.                         // probability assigned to each observation in this ar
> tificial data set 
.                         // (which will later be matched to ACS data set)
.                         // Thanks to Clyde Schechter; https://www.statalist.or
> g/forums/forum/general-stata-discussion/general/1475890-is-there-a-command-tha
> t-is-equivalent-to-bsample-more-than-_n
.                                 quietly des 
 51.                                 local N = r(N)
 52. 
.                                 clear
 53.                                 set obs `sample_size'
 54.                                 *set seed 1
. 
.                                 gen obs_no = runiformint(1, `N')
 55.                                 merge m:1 obs_no using "$temp/redi03_ASEC-h
> hincome_year_inc`inc_level'.dta", keep(match) nogenerate 
 56.                                                                            
>                              
.                         // #3D) Add new columns for lower_bound and upper_boun
> d of income bin
.                                 gen acs_hinc_shp_lb = `lower_bound'
 57.                                 gen acs_hinc_shp_ub = `upper_bound'
 58.                         // Label new upper and lower income bound variables
.                                 label variable acs_hinc_shp_lb "acs_hinc_shp L
> ower Bound"
 59.                                 label variable acs_hinc_shp_ub "acs_hinc_sh
> p Upper Bound"
 60. 
.                                 save "$temp/redi03_ASEC-hhincome_year_inc`inc_
> level'.dta", replace
 61.                                 
. 
.                         // #4) Merge ACS (using=premerge) and ASEC data (maste
> r) 
.                         // here, ASEC artificial datase (from step 3A) is matc
> hed 
.                         // to ACS for that incomebin for that year            
>                                                   
.                                 gen id = _n
 62.                                 merge 1:1 id using `premerge_`inc_level'_`y
> ''
 63.                                 
.                                 di "Merged ASEC values with original ACS datas
> et for inc_level " `inc_level' ///
>                                    " ($`lower_bound'-`upper_bound') and year `
> y'."
 64.                                                 
.                         // #5) create count within each REDI income bin
.                                 generate        redi_hinc_shp_n = .
 65.                                 replace         redi_hinc_shp_n = `N' // r(
> N) from above
 66.                                 label var       redi_hinc_shp_n "household 
> (REDI) shp count of respondents in each income bin in post-merge dataset'"
 67. 
.                         // Save these new redi data (with yearly ASEC continuo
> us data) in a tempfile we can use later for merging, etc.
.                                 tempfile temp_`inc_level'_`y'
 68.                                 save `temp_`inc_level'_`y'', replace
 69.                                 di "Saved REDI data (with ASEC continuous d
> ata) for inc_level " `inc_level' " ($`lower_bound'-`upper_bound') and year `y'
>  in file"
 70.                 
.                 }  //  close loop through all values of income categories (`in
> c_level')
 71.                                 
.                 di  in red "Moved outside loop of year income bracket " `inc_l
> evel' " ($`lower_bound'-`upper_bound')."
 72.                 
.                 // append all income brackets across all years
.                         tokenize `acs_hinc_shp_levels'
 73.                         local first `1'
 74.                         use `temp_`1'_`y'', clear
 75.                         macro shift
 76.                         local rest `*'
 77. 
.                 // now loop through and append each temp file created within i
> ncome bracket loop
.                         foreach bracket in `*' {
 78.                                 append using `temp_`bracket'_`y''
 79.                         }
 80. 
.                 // create new tempfile to save each year's data for all income
>  levels
.                         tempfile temp_`y'
 81.                         save `temp_`y'', replace
 82.                         di "Saved new tempfile  for year `y' for all REDI i
> ncome brackets."
 83. 
.                                                 
.         } //  end of loop through all years
(ACS data with artificial bins, CA 2019)
(362,110 observations deleted)
The current inc_level is: 1
The inc_level 1 is at the lowest end of the original ACS income range
inc_decoded: characters L e s space t h a n $ removed; acs_hinc_shp_ub generated
>  as int
Lower bound of -100,000 created for inc_level 1
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000002 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000002 saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,679 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc1.dta saved
Keep income between $-100000 and $15000 for 2019 year.
number of observations (_N) was 0, now 17,981

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,981  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc1.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,981  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 1 ($-100000-15000) an
> d year 2019.
(17,981 missing values generated)
(17,981 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000003 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000003 saved
Saved REDI data (with ASEC continuous data) for inc_level 1 ($-100000-15000) and
>  year 2019 in file
(ACS data with artificial bins, CA 2019)
(362,779 observations deleted)
The current inc_level is: 2
The inc_level 2 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as int
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 2of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000004 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000004 saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,775 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc2.dta saved
Keep income between $15000 and $25000 for 2019 year.
number of observations (_N) was 0, now 17,312

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,312  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc2.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,312  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 2 ($15000-25000) and 
> year 2019.
(17,312 missing values generated)
(17,312 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000005 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000005 saved
Saved REDI data (with ASEC continuous data) for inc_level 2 ($15000-25000) and y
> ear 2019 in file
(ACS data with artificial bins, CA 2019)
(360,497 observations deleted)
The current inc_level is: 3
The inc_level 3 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 3of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000006 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000006 saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,714 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc3.dta saved
Keep income between $25000 and $35000 for 2019 year.
number of observations (_N) was 0, now 19,594

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            19,594  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc3.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            19,594  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 3 ($25000-35000) and 
> year 2019.
(19,594 missing values generated)
(19,594 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000007 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000007 saved
Saved REDI data (with ASEC continuous data) for inc_level 3 ($25000-35000) and y
> ear 2019 in file
(ACS data with artificial bins, CA 2019)
(347,770 observations deleted)
The current inc_level is: 4
The inc_level 4 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 4of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000008 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000008 saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,519 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc4.dta saved
Keep income between $35000 and $50000 for 2019 year.
number of observations (_N) was 0, now 32,321

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            32,321  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc4.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            32,321  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 4 ($35000-50000) and 
> year 2019.
(32,321 missing values generated)
(32,321 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000009 not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.000009 saved
Saved REDI data (with ASEC continuous data) for inc_level 4 ($35000-50000) and y
> ear 2019 in file
(ACS data with artificial bins, CA 2019)
(328,388 observations deleted)
The current inc_level is: 5
The inc_level 5 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 5of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000a not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000a saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,240 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc5.dta saved
Keep income between $50000 and $75000 for 2019 year.
number of observations (_N) was 0, now 51,703

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            51,703  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc5.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            51,703  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 5 ($50000-75000) and 
> year 2019.
(51,703 missing values generated)
(51,703 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000b not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000b saved
Saved REDI data (with ASEC continuous data) for inc_level 5 ($50000-75000) and y
> ear 2019 in file
(ACS data with artificial bins, CA 2019)
(331,796 observations deleted)
The current inc_level is: 6
The inc_level 6 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 6of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000c not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000c saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,434 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc6.dta saved
Keep income between $75000 and $100000 for 2019 year.
number of observations (_N) was 0, now 48,295

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            48,295  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc6.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            48,295  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 6 ($75000-100000) and
>  year 2019.
(48,295 missing values generated)
(48,295 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000d not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000d saved
Saved REDI data (with ASEC continuous data) for inc_level 6 ($75000-100000) and 
> year 2019 in file
(ACS data with artificial bins, CA 2019)
(309,228 observations deleted)
The current inc_level is: 7
The inc_level 7 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 7of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000e not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000e saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,295 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc7.dta saved
Keep income between $100000 and $150000 for 2019 year.
number of observations (_N) was 0, now 70,863

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            70,863  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc7.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            70,863  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 7 ($100000-150000) an
> d year 2019.
(70,863 missing values generated)
(70,863 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000f not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000f saved
Saved REDI data (with ASEC continuous data) for inc_level 7 ($100000-150000) and
>  year 2019 in file
(ACS data with artificial bins, CA 2019)
(338,355 observations deleted)
The current inc_level is: 8
The inc_level 8 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 8of the original ACS income range
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000g not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000g saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,769 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc8.dta saved
Keep income between $150000 and $200000 for 2019 year.
number of observations (_N) was 0, now 41,736

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            41,736  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc8.dta saved
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            41,736  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 8 ($150000-200000) an
> d year 2019.
(41,736 missing values generated)
(41,736 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000h not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000h saved
Saved REDI data (with ASEC continuous data) for inc_level 8 ($150000-200000) and
>  year 2019 in file
(ACS data with artificial bins, CA 2019)
(315,897 observations deleted)
The current inc_level is: 9
The inc_level 9 is at the highest end of the original ACS income range
inc_decoded: characters space o e r m removed; acs_hinc_shp_lb generated as long
Upper bound of 999999 created for inc_level 9
note: label truncated to 80 characters
(0 observations deleted)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000i not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000i saved
(Streamlined CPS ASEC data, CA 2019)
Calculating household income using hhincome ASEC variable.
(5,528 observations deleted)
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc9.dta saved
Keep income between $200000 and $999999 for 2019 year.
number of observations (_N) was 0, now 64,194

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            64,194  
    -----------------------------------------
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi03_ASEC-hhincome_ye
> ar_inc9.dta saved
(note: variable acs_hinc_shp_lb was float, now double to accommodate using
       data's values)
(label diffmob_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label hispan_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            64,194  (_merge==3)
    -----------------------------------------
Merged ASEC values with original ACS dataset for inc_level 9 ($200000-999999) an
> d year 2019.
(64,194 missing values generated)
(64,194 real changes made)
note: label truncated to 80 characters
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000j not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000j saved
Saved REDI data (with ASEC continuous data) for inc_level 9 ($200000-999999) and
>  year 2019 in file
Moved outside loop of year income bracket  ($200000-999999).
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(note: variable acs_hinc_shp_lb was float, now double to accommodate using
       data's values)
(label _merge already defined)
(label dB_edu_colp already defined)
(label dB_edu_grad already defined)
(label dB_edu_col already defined)
(label dB_edu_sCol already defined)
(label dB_edu_HS already defined)
(label dB_edu_lHS already defined)
(label edu_5categ already defined)
(label race_5categ already defined)
(label dB_rother already defined)
(label dB_rhisp already defined)
(label dB_rasian already defined)
(label dB_rblack already defined)
(label dB_rwhite already defined)
(label dB_fem already defined)
(label sample_lbl already defined)
(label repwt_lbl already defined)
(label gq_lbl already defined)
(label ownershpd_lbl already defined)
(label repwtp_lbl already defined)
(label raced_lbl already defined)
(label hispand_lbl already defined)
(label educd_lbl already defined)
(label migrate1d_lbl already defined)
(label cat_inc already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(note: file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000k not
>  found)
file /var/folders/rp/96l526kj7ybdjr5vs5bqqjw80000gn/T//S_04358.00000k saved
Saved new tempfile  for year 2019 for all REDI income brackets.

.                                 
.         // append all years 
.                 tokenize `years'

.                 local first `1'

.                 use `temp_`1'', clear

.                 macro shift

.                 local rest `*'

. 
.         // now loop through and append each yearly temp file created earlier
.                 foreach ytemp in `*' {
  2.                         append using `temp_`ytemp''
  3.                 }

.                 di "Appended all years "
Appended all years 

. 
. // CLEAN UP
. 
. sort year acs_hinc_shp id

. drop obs_no id inc_decoded

. 
. tab _merge

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
            matched (3) |    363,999      100.00      100.00
------------------------+-----------------------------------
                  Total |    363,999      100.00

. drop _merge

. 
. di in red "End of redi03a_categ_distrib.doi for household and shp variables" 
End of redi03a_categ_distrib.doi for household and shp variables

. 
. 
. // Clean Up
. keep if year == 2019
(0 observations deleted)

. drop gq sample serial cbserial countyfip age nchild whymove union  month

. svyset[pweight=perwt], vce(brr) brrweight(repwtp1-repwtp80) fay(.5)mse

      pweight: perwt
          VCE: brr
          MSE: on
    brrweight: repwtp1 .. repwtp80
          fay: .5
  Single unit: missing
     Strata 1: <one>
         SU 1: <observations>
        FPC 1: <zero>

. 
. rename  hhincome_asec redi_hinc 

. rename acs_hinc_shp acs_hinc

. order acs_hinc redi_hinc hhincome_acs acs_hinc_shp_lb acs_hinc_shp_ub 

. 
. // CREATE NATURAL LOG INCOME VARIABLES
. gen redi_hinc_ln = ln(redi_hinc)
(2,701 missing values generated)

. replace redi_hinc_ln = 0 if redi_hinc == 0
(2,591 real changes made)

. 
. gen acs_hinc_ln = ln(hhincome_acs)
(2,542 missing values generated)

. replace acs_hinc_ln = 0 if hhincome_acs <= 0
(2,542 real changes made)

. 
. // Save Data 
. label data "California 2019 ACS data converted to continuous REDI-calculated v
> alues"

. notes: redi13_REDI_Ca2019.dta \ ///
>         ACS hinc_shp Data converted to continuous REDI \ /// 
>         redi13_REDI_state_example.do  $S_DATE

. compress
  variable redi_hinc_shp_n was float now int
  variable acs_hinc_shp_lb was double now long
  (2,183,994 bytes saved)

. datasignature set, reset  
  363999:226(105185):2481695535:686636857       (data signature reset)

. save $deriv/redi14_REDI_Ca2019.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_derv/redi14_REDI_Ca2019.dta 
> saved

. 
. di in red "Completed REDI conversions for California 2019 data" 
Completed REDI conversions for California 2019 data

. 
. 
. ***--------------------------***
. 
. capture log close redi14_REDI_state_dataprep

. exit

end of do-file


. do "/Users/mollymking/Documents/SocResearch/Dissertation/redi/redi15_REDI_stat
> e_regressions.do"

. capture log close redi15_REDI_state_regressions

. log using $redi/redi15_REDI_state_regressions.log, name(redi15_REDI_state_regr
> essions) replace text
--------------------------------------------------------------------------------
      name:  redi15_REDI_state_regressions
       log:  /Users/mollymking/Documents/SocResearch/Dissertation/redi/redi15_RE
> DI_state_regressions.log
  log type:  text
 opened on:   9 Nov 2021, 21:12:58

. 
. //      project:        REDI Methods Paper
. 
. //  task:       Example of REDI regressed on data from a single state in 2019
. //  data:       CPS ASEC from IPUMS, available: https://cps.ipums.org/
. //                              ACS from IPUMS, available: https://usa.ipums.o
> rg/
. 
. //  github:     redi
. //  OSF:                https://osf.io/qmhe8/
. 
. //  author:     Molly King
. 
. display "$S_DATE  $S_TIME"
 9 Nov 2021  21:12:58

. 
. ***--------------------------***
. // # PROGRAM SETUP
. ***--------------------------***
. 
. version 16 // keeps program consistent for future replications

. set linesize 80

. clear all

. set more off

. set seed 1

. 
. ***--------------------------***
. // #  REGRESSION: Income as IV: Predict Migration on 2019  Wyoming  DATA
. ***--------------------------***
. 
. use $deriv/redi14_REDI_Wy2019.dta, clear
(Wyoming 2019 ACS data converted to continuous REDI-calculated values)

. 
. // REDI Income as IV (redi_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ln(REDI-created income), "
>  ///
>                   "gender, race/ethnicity, education, marriage, disability"
WYOMING: Predict migration as function of ln(REDI-created income), gender, race/
> ethnicity, education, marriage, disability

. svy: logistic migrate ///
>         redi_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability   // labor ownhouse
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,694
                                                Population size   =    452,157
                                                Replications      =         80
                                                Design df         =         79
                                                F(  12,     68)   =       6.74
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
redi_hinc_ln |   .8304723   .0307001    -5.03   0.000     .7715593    .8938837
      dB_fem |   1.058523   .0923869     0.65   0.517     .8897184    1.259354
   dB_rblack |   4.347102   2.228239     2.87   0.005     1.567127    12.05856
   dB_rasian |   3.207769   1.922537     1.94   0.055     .9729955    10.57537
    dB_rhisp |   2.064265   .4407147     3.39   0.001     1.349614    3.157339
   dB_rother |   1.206139   .2895548     0.78   0.437     .7479507     1.94501
   dB_edu_HS |    2.24524   .5728995     3.17   0.002     1.351109    3.731086
 dB_edu_sCol |   2.395293   .6933071     3.02   0.003     1.346325    4.261549
  dB_edu_col |   1.957533   .5640522     2.33   0.022     1.103126    3.473707
 dB_edu_grad |   2.320433   .7371252     2.65   0.010     1.233004    4.366904
     married |   .4575338   .0694223    -5.15   0.000     .3382674    .6188511
  disability |   .7839209   .2373985    -0.80   0.424     .4290315     1.43237
       _cons |   .8664818    .391114    -0.32   0.752     .3528307    2.127906
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. // Original ACS Continuous Income as IV (acs_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ln(ACS HH income), " ///
>                   "gender, race/ethnicity, education, marriage, disability"
WYOMING: Predict migration as function of ln(ACS HH income), gender, race/ethnic
> ity, education, marriage, disability

. svy: logistic migrate ///
>         acs_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability //  labor  ownhouse
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,693
                                                Population size   =    451,787
                                                Replications      =         80
                                                Design df         =         79
                                                F(  12,     68)   =       6.31
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 acs_hinc_ln |    .847445   .0393859    -3.56   0.001     .7725661    .9295813
      dB_fem |   1.074697   .0933112     0.83   0.409     .9041286    1.277443
   dB_rblack |   4.206285   2.155971     2.80   0.006     1.516425    11.66746
   dB_rasian |   3.222012   1.919265     1.96   0.053     .9844708    10.54512
    dB_rhisp |   1.968983   .4161953     3.21   0.002     1.292766    2.998913
   dB_rother |   1.165744   .2950905     0.61   0.546     .7043409    1.929405
   dB_edu_HS |    2.23777   .5657087     3.19   0.002     1.352959    3.701233
 dB_edu_sCol |   2.416141   .6912803     3.08   0.003     1.367091    4.270188
  dB_edu_col |   2.005462   .5716729     2.44   0.017       1.1371    3.536962
 dB_edu_grad |   2.242088   .7113141     2.54   0.013     1.192351    4.216006
     married |   .4495843   .0684513    -5.25   0.000     .3320443    .6087323
  disability |   .7650869   .2306425    -0.89   0.377      .419872    1.394134
       _cons |   .7059218   .3940363    -0.62   0.534     .2324003    2.144256
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
. // Artificial ACS categorical Income as IV (acs_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ACS HH income category, " 
> ///
>                   "gender, race/ethnicity, education, marriage, disability"
WYOMING: Predict migration as function of ACS HH income category, gender, race/e
> thnicity, education, marriage, disability

. fvset base 1 acs_hinc

. svy: logistic migrate ///
>         i.acs_hinc /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability //  labor  ownhouse
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,694
                                                Population size   =    452,157
                                                Replications      =         80
                                                Design df         =         79
                                                F(  19,     61)   =       3.69
                                                Prob > F          =     0.0001

-------------------------------------------------------------------------------
              |                BRR *
      migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     acs_hinc |
15000 to l..  |   .8156415   .2713891    -0.61   0.542     .4206035    1.581706
25000 to l..  |   1.297266   .3843589     0.88   0.382     .7192984     2.33964
35000 to l..  |   .8338917   .2111729    -0.72   0.475      .503733    1.380444
50000 to l..  |   .5111725   .1337018    -2.57   0.012     .3037141    .8603399
75000 to l..  |   .3650237   .1176133    -3.13   0.002      .192217    .6931868
100000 to ..  |   .4195809   .1193517    -3.05   0.003     .2381888    .7391115
150000 to ..  |   .3125431   .1044641    -3.48   0.001     .1606867    .6079111
200000 or ..  |   .4748709   .1672412    -2.11   0.038     .2355779    .9572308
              |
       dB_fem |   1.024625   .0887348     0.28   0.780     .8623872    1.217384
    dB_rblack |   3.836006   2.156219     2.39   0.019     1.253074    11.74308
    dB_rasian |   2.956735   1.919145     1.67   0.099     .8123146    10.76219
     dB_rhisp |   2.057348   .4547104     3.26   0.002     1.325106    3.194219
    dB_rother |   1.229464   .2883597     0.88   0.381     .7708482    1.960933
    dB_edu_HS |   2.130565   .5435816     2.96   0.004      1.28217    3.540333
  dB_edu_sCol |   2.261716   .6616868     2.79   0.007      1.26339    4.048916
   dB_edu_col |   1.947047   .5767535     2.25   0.027     1.079722    3.511082
  dB_edu_grad |   2.304576   .7510408     2.56   0.012     1.204695    4.408642
      married |    .508104   .0802696    -4.29   0.000     .3710131    .6958505
   disability |   .7118981   .2250018    -1.08   0.286     .3794926    1.335464
        _cons |   .2024151   .0603152    -5.36   0.000     .1118558    .3662918
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
.         
.         
. ***------------
. // In both models, significance disappears when add home ownership:
. // REDI Income as IV (redi_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ln(REDI-created income), "
>  ///
>                   "add home ownership"
WYOMING: Predict migration as function of ln(REDI-created income), add home owne
> rship

. svy: logistic migrate ///
>         redi_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability ownhouse //
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,694
                                                Population size   =    452,157
                                                Replications      =         80
                                                Design df         =         79
                                                F(  13,     67)   =      14.62
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
redi_hinc_ln |   .9159679    .035556    -2.26   0.026     .8478604    .9895464
      dB_fem |   1.090879   .0982162     0.97   0.337     .9119005    1.304986
   dB_rblack |   2.895166   1.649036     1.87   0.066     .9317572     8.99589
   dB_rasian |   2.746603    1.87635     1.48   0.143     .7050991    10.69896
    dB_rhisp |   1.726011   .3684677     2.56   0.012     1.128504    2.639879
   dB_rother |    1.13929   .2830918     0.52   0.601      .694764    1.868235
   dB_edu_HS |   1.944482   .5636329     2.29   0.024      1.09203    3.462369
 dB_edu_sCol |   2.145725   .6926541     2.37   0.020     1.128566    4.079637
  dB_edu_col |   1.836479   .6038095     1.85   0.068     .9544854    3.533481
 dB_edu_grad |   2.115499    .757265     2.09   0.040     1.037473    4.313688
     married |   .6181352   .1049046    -2.83   0.006     .4409383    .8665409
  disability |   .7291866   .2001643    -1.15   0.253     .4222273    1.259305
    ownhouse |   .2297209   .0374528    -9.02   0.000     .1660601    .3177868
       _cons |   .7332833   .3317961    -0.69   0.495     .2979402    1.804739
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
. 
. // Original ACS Contnuous Income as IV (acs_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ln(ACS HH income), " ///
>                   "add home ownership"
WYOMING: Predict migration as function of ln(ACS HH income), add home ownership

. svy: logistic migrate ///
>         acs_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability ownhouse //  
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,693
                                                Population size   =    451,787
                                                Replications      =         80
                                                Design df         =         79
                                                F(  13,     67)   =      13.81
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 acs_hinc_ln |   .9415949   .0538024    -1.05   0.295     .8403693    1.055013
      dB_fem |    1.10063   .0991875     1.06   0.291     .9198961    1.316872
   dB_rblack |   2.856194   1.627302     1.84   0.069      .918918    8.877664
   dB_rasian |   2.735534   1.865354     1.48   0.144     .7040144    10.62925
    dB_rhisp |     1.6879   .3564116     2.48   0.015       1.1087    2.569683
   dB_rother |   1.124895   .2866776     0.46   0.645     .6773463    1.868158
   dB_edu_HS |   1.951373   .5612736     2.32   0.023     1.100781    3.459232
 dB_edu_sCol |   2.158942    .691347     2.40   0.019     1.141367    4.083727
  dB_edu_col |   1.861774   .6087661     1.90   0.061     .9711142    3.569304
 dB_edu_grad |   2.076299   .7419169     2.04   0.044     1.019534    4.228417
     married |   .6077125   .1043204    -2.90   0.005     .4318246    .8552418
  disability |    .725446   .1993933    -1.17   0.246     .4197667    1.253725
    ownhouse |   .2260492   .0366903    -9.16   0.000     .1636419    .3122563
       _cons |   .5525365   .3570026    -0.92   0.361     .1526974    1.999357
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
. 
. // Artificial ACS categorical Income as IV (acs_hinc_ln)
. di in red "WYOMING: " ///
>                   "Predict migration as function of ACS HH income category, " 
> ///
>                   "add home ownership"
WYOMING: Predict migration as function of ACS HH income category, add home owner
> ship

. svy: logistic migrate ///
>         i.acs_hinc /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability  ownhouse //  labor  ownhouse
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                     Number of obs     =      4,694
                                                Population size   =    452,157
                                                Replications      =         80
                                                Design df         =         79
                                                F(  20,     60)   =       9.25
                                                Prob > F          =     0.0000

-------------------------------------------------------------------------------
              |                BRR *
      migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     acs_hinc |
15000 to l..  |   .8635408   .2970461    -0.43   0.671     .4354386    1.712533
25000 to l..  |   1.732434   .5480432     1.74   0.086     .9229897    3.251747
35000 to l..  |   1.185715   .3087184     0.65   0.515     .7061714    1.990904
50000 to l..  |   .7789933   .2171462    -0.90   0.373     .4472688    1.356747
75000 to l..  |   .6227757   .2094831    -1.41   0.163     .3188302    1.216477
100000 to ..  |   .7605474    .237457    -0.88   0.383     .4085373    1.415862
150000 to ..  |   .7158015   .2708356    -0.88   0.380     .3370672    1.520088
200000 or ..  |   1.019217   .3393067     0.06   0.955      .525395    1.977184
              |
       dB_fem |   1.066921   .0975939     0.71   0.481     .8893232    1.279985
    dB_rblack |    2.74532   1.745624     1.59   0.116     .7743439    9.733119
    dB_rasian |   2.590258   1.839708     1.34   0.184     .6300589     10.6489
     dB_rhisp |    1.72995    .378913     2.50   0.014      1.11865    2.675305
    dB_rother |   1.159335   .2913774     0.59   0.558     .7029878    1.911923
    dB_edu_HS |    1.94429    .562407     2.30   0.024     1.093231    3.457882
  dB_edu_sCol |   2.130735   .6879911     2.34   0.022     1.120497    4.051801
   dB_edu_col |   1.865688   .6222916     1.87   0.065     .9605245    3.623844
  dB_edu_grad |   2.104413   .7649992     2.05   0.044     1.020676    4.338844
      married |   .6446319   .1120907    -2.53   0.014     .4560368     .911221
   disability |   .7236832   .2074586    -1.13   0.263     .4090145    1.280437
     ownhouse |   .2329996   .0380795    -8.91   0.000     .1682977    .3225763
        _cons |   .3168763   .1063244    -3.43   0.001     .1624935    .6179362
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. ***--------------------------***
. // #  REGRESSION: Income as IV: Predict Migration on 2019  California  DATA
. ***--------------------------***
. 
. use $deriv/redi14_REDI_Ca2019.dta, clear
(California 2019 ACS data converted to continuous REDI-calculated values)

. 
. // REDI Income as IV (redi_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ln(REDI-created income), "
>  ///
>                   "gender, race/ethnicity, education, marriage, disability"
CALIFORNIA: Predict migration as function of ln(REDI-created income), gender, ra
> ce/ethnicity, education, marriage, disability

. svy: logistic migrate ///
>         redi_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability 
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,154
                                               Population size   =  31,298,289
                                               Replications      =          80
                                               Design df         =          79
                                               F(  12,     68)   =      128.06
                                               Prob > F          =      0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
redi_hinc_ln |   .9435509   .0050083   -10.95   0.000     .9336347    .9535725
      dB_fem |   .9366623   .0128455    -4.77   0.000     .9114398    .9625827
   dB_rblack |   1.047596   .0489273     1.00   0.322     .9545984    1.149654
   dB_rasian |   1.055756   .0233517     2.45   0.016     1.010284    1.103275
    dB_rhisp |   .8503091   .0195141    -7.07   0.000      .812341    .8900518
   dB_rother |   1.272419   .0575511     5.33   0.000     1.162872    1.392287
   dB_edu_HS |   1.375375   .0456053     9.61   0.000     1.287531    1.469213
 dB_edu_sCol |   1.481185    .042748    13.61   0.000     1.398495    1.568764
  dB_edu_col |   2.028785   .0684531    20.97   0.000     1.897007    2.169717
 dB_edu_grad |   2.071065   .0785961    19.19   0.000     1.920386    2.233567
     married |   .6049411   .0121287   -25.07   0.000      .581275    .6295709
  disability |     .67765   .0251038   -10.50   0.000     .6294799    .7295062
       _cons |   .2151024   .0152507   -21.67   0.000     .1867913    .2477045
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
. // Original ACS Contnuous Income as IV (acs_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ln(ACS HH income), " ///
>                   "gender, race/ethnicity, education, marriage, disability"
CALIFORNIA: Predict migration as function of ln(ACS HH income), gender, race/eth
> nicity, education, marriage, disability

. svy: logistic migrate ///
>         acs_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability 
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,245
                                               Population size   =  31,307,314
                                               Replications      =          80
                                               Design df         =          79
                                               F(  12,     68)   =      120.98
                                               Prob > F          =      0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 acs_hinc_ln |   .9368348   .0054951   -11.12   0.000     .9259607    .9478367
      dB_fem |   .9369998   .0128294    -4.75   0.000     .9118084    .9628873
   dB_rblack |   1.044921   .0487701     0.94   0.349     .9522192    1.146647
   dB_rasian |   1.050248   .0233386     2.21   0.030     1.004806    1.097745
    dB_rhisp |    .850753     .01943    -7.08   0.000     .8129445      .89032
   dB_rother |   1.275898   .0572507     5.43   0.000     1.166884    1.395097
   dB_edu_HS |   1.375132   .0457051     9.58   0.000     1.287102    1.469182
 dB_edu_sCol |   1.478536   .0430937    13.42   0.000     1.395201    1.566849
  dB_edu_col |    2.03395   .0692733    20.85   0.000     1.900635    2.176616
 dB_edu_grad |   2.084415   .0800331    19.13   0.000     1.931048    2.249962
     married |   .6073822   .0120961   -25.04   0.000     .5837764    .6319426
  disability |   .6798401   .0249417   -10.52   0.000     .6319642    .7313428
       _cons |   .2329548   .0169289   -20.05   0.000     .2015823    .2692098
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. // Artificial ACS categorical Income as IV (acs_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ACS HH income category, " 
> ///
>                   "gender, race/ethnicity, education, marriage, disability"
CALIFORNIA: Predict migration as function of ACS HH income category, gender, rac
> e/ethnicity, education, marriage, disability

. fvset base 1 acs_hinc

. svy: logistic migrate ///
>         i.acs_hinc /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability //  labor  ownhouse
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,245
                                               Population size   =  31,307,314
                                               Replications      =          80
                                               Design df         =          79
                                               F(  19,     61)   =       86.01
                                               Prob > F          =      0.0000

-------------------------------------------------------------------------------
              |                BRR *
      migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     acs_hinc |
15000 to l..  |   .8488902   .0456647    -3.05   0.003     .7626939    .9448281
25000 to l..  |   .7561957   .0470003    -4.50   0.000     .6681994    .8557804
35000 to l..  |   .8496371   .0379762    -3.65   0.000     .7773123    .9286914
50000 to l..  |   .7472799   .0350085    -6.22   0.000     .6807476    .8203148
75000 to l..  |   .7009359   .0319658    -7.79   0.000     .6401119    .7675395
100000 to ..  |   .6731798   .0343055    -7.77   0.000     .6082454    .7450465
150000 to ..  |   .6148361   .0290882   -10.28   0.000       .55958    .6755485
200000 or ..  |   .6711577    .027045    -9.90   0.000     .6194283    .7272071
              |
       dB_fem |   .9322253   .0128641    -5.09   0.000     .9069685    .9581855
    dB_rblack |   1.036941   .0485129     0.78   0.440     .9447381    1.138142
    dB_rasian |   1.057971   .0235499     2.53   0.013     1.012119      1.1059
     dB_rhisp |   .8502226    .019908    -6.93   0.000     .8115059    .8907864
    dB_rother |   1.279752   .0573761     5.50   0.000     1.170495    1.399207
    dB_edu_HS |   1.386862   .0461958     9.82   0.000     1.297893    1.481929
  dB_edu_sCol |   1.501907   .0432948    14.11   0.000     1.418156    1.590603
   dB_edu_col |   2.084941   .0694646    22.05   0.000      1.95116    2.227894
  dB_edu_grad |    2.13285   .0797009    20.27   0.000     1.979965    2.297539
      married |   .6129849    .012167   -24.66   0.000     .5892393    .6376875
   disability |   .6623069    .024461   -11.16   0.000     .6153651    .7128296
        _cons |    .151899   .0071843   -39.85   0.000     .1382516    .1668937
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
.         
. ***------------
. // In both models, significance disappears when add home ownership:
. // REDI Income as IV (redi_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ln(REDI-created income), "
>  ///
>                   "add home ownership"
CALIFORNIA: Predict migration as function of ln(REDI-created income), add home o
> wnership

. svy: logistic migrate ///
>         redi_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability ownhouse  
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,154
                                               Population size   =  31,298,289
                                               Replications      =          80
                                               Design df         =          79
                                               F(  13,     67)   =      226.24
                                               Prob > F          =      0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
redi_hinc_ln |   1.008244    .006745     1.23   0.223      .994907    1.021759
      dB_fem |    .948586   .0131484    -3.81   0.000     .9227725    .9751216
   dB_rblack |   .8777258   .0423629    -2.70   0.008     .7973282    .9662302
   dB_rasian |    1.02268   .0227321     1.01   0.316     .9784195    1.068943
    dB_rhisp |   .7339192   .0177815   -12.77   0.000     .6993659    .7701797
   dB_rother |    1.15526   .0532977     3.13   0.002     1.053899     1.26637
   dB_edu_HS |   1.430486   .0479226    10.69   0.000     1.338209    1.529126
 dB_edu_sCol |     1.5582   .0450596    15.34   0.000     1.471044    1.650521
  dB_edu_col |   2.110224   .0705772    22.33   0.000     1.974318    2.255486
 dB_edu_grad |   2.234607   .0857051    20.96   0.000     2.070364    2.411879
     married |   .7105258   .0138894   -17.48   0.000     .6834105    .7387169
  disability |   .7128211   .0266828    -9.04   0.000     .6616406    .7679606
    ownhouse |   .3213215   .0078422   -46.52   0.000     .3060852    .3373163
       _cons |   .1677235   .0141671   -21.14   0.000     .1417678    .1984315
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. // Original ACS Contnuous Income as IV (acs_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ln(ACS HH income), " ///
>                   "add home ownership"
CALIFORNIA: Predict migration as function of ln(ACS HH income), add home ownersh
> ip

. svy: logistic migrate ///
>         acs_hinc_ln /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability ownhouse 
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,245
                                               Population size   =  31,307,314
                                               Replications      =          80
                                               Design df         =          79
                                               F(  13,     67)   =      226.89
                                               Prob > F          =      0.0000

------------------------------------------------------------------------------
             |                BRR *
     migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 acs_hinc_ln |   1.001878   .0074817     0.25   0.802     .9870967    1.016882
      dB_fem |   .9476824   .0131068    -3.89   0.000     .9219498    .9741333
   dB_rblack |   .8751409   .0420044    -2.78   0.007     .7954028    .9628727
   dB_rasian |   1.023029   .0227061     1.03   0.308     .9788174    1.069237
    dB_rhisp |   .7339024   .0177706   -12.78   0.000     .6993696    .7701402
   dB_rother |   1.159872   .0532752     3.23   0.002     1.058533    1.270912
   dB_edu_HS |   1.431019   .0479587    10.69   0.000     1.338674    1.529734
 dB_edu_sCol |   1.560721   .0453896    15.31   0.000      1.47294    1.653732
  dB_edu_col |    2.11696   .0719826    22.06   0.000     1.978423    2.265198
 dB_edu_grad |    2.24416   .0874209    20.75   0.000     2.076728    2.425091
     married |   .7116784   .0137926   -17.55   0.000     .6847478    .7396683
  disability |   .7082635   .0261679    -9.34   0.000     .6580467    .7623125
    ownhouse |   .3223763   .0079627   -45.83   0.000     .3069102    .3386218
       _cons |   .1794594   .0155872   -19.78   0.000     .1509677    .2133283
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. // Artificial ACS categorical Income as IV (acs_hinc_ln)
. di in red "CALIFORNIA: " ///
>                   "Predict migration as function of ACS HH income category, " 
> ///
>                    "add home ownership"
CALIFORNIA: Predict migration as function of ACS HH income category, add home ow
> nership

. svy: logistic migrate ///
>         i.acs_hinc /// 
>         dB_fem /// men comparison
>         dB_rblack dB_rasian dB_rhisp dB_rother /// white comparison category
>         dB_edu_HS dB_edu_sCol dB_edu_col dB_edu_grad /// lessHS comparison cat
> egory
>         married disability ownhouse      //  labor  
(running logistic on estimation sample)

BRR replications (80)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..............................

Survey: Logistic regression                    Number of obs     =     302,245
                                               Population size   =  31,307,314
                                               Replications      =          80
                                               Design df         =          79
                                               F(  20,     60)   =      155.77
                                               Prob > F          =      0.0000

-------------------------------------------------------------------------------
              |                BRR *
      migrate | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     acs_hinc |
15000 to l..  |   .8706044   .0475565    -2.54   0.013     .7809101    .9706009
25000 to l..  |   .8038191   .0512296    -3.43   0.001      .708052    .9125392
35000 to l..  |   .9438112   .0414947    -1.32   0.192     .8647289    1.030126
50000 to l..  |   .8890944    .041048    -2.55   0.013     .8110321    .9746703
75000 to l..  |   .8921543   .0401655    -2.53   0.013     .8156843    .9757933
100000 to ..  |   .9476325   .0471918    -1.08   0.283     .8582049    1.046379
150000 to ..  |   .9361407   .0452726    -1.36   0.176     .8502291    1.030733
200000 or ..  |   1.119829   .0469183     2.70   0.008     1.030228    1.217222
              |
       dB_fem |   .9522996   .0133383    -3.49   0.001     .9261171    .9792223
    dB_rblack |   .8830703   .0427252    -2.57   0.012     .8019945    .9723423
    dB_rasian |   1.015603   .0226405     0.69   0.489     .9715238    1.061683
     dB_rhisp |   .7463961   .0183766   -11.88   0.000     .7107001    .7838849
    dB_rother |    1.15741   .0531921     3.18   0.002     1.056232     1.26828
    dB_edu_HS |   1.434405   .0482595    10.72   0.000     1.341493    1.533753
  dB_edu_sCol |   1.557041    .044914    15.35   0.000      1.47016    1.649056
   dB_edu_col |   2.059001   .0676845    21.97   0.000     1.928591    2.198229
  dB_edu_grad |   2.141925   .0801835    20.35   0.000     1.988125    2.307623
      married |   .7069823   .0137334   -17.85   0.000     .6801685    .7348532
   disability |   .7139159    .026807    -8.97   0.000     .6625032    .7693184
     ownhouse |   .3129324   .0077767   -46.75   0.000     .2978298    .3288008
        _cons |   .1980513   .0095973   -33.41   0.000     .1798408    .2181058
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         
. ***--------------------------***
. 
. capture log close redi15_REDI_state_regressions

. exit

end of do-file


. exit
