--------------------------------------------------------------------------------
      name:  redi14_REDI_state_dataprep
       log:  /Users/mmking/Documents/SocResearch/redi/redi_code/redi14_REDI_stat
> e_dataprep.log
  log type:  text
 opened on:  31 May 2022, 23:06:35

. 
. //      project:        REDI Methods Paper
. 
. //  task:       Creating state samples and REDI income for state example
. //  data:       CPS ASEC from IPUMS, available: https://cps.ipums.org/
. //                              ACS from IPUMS, available: https://usa.ipums.o
> rg/
. 
. //  github:     redi
. //  OSF:                https://osf.io/qmhe8/
. 
. //  author:     Molly King
. 
. display "$S_DATE  $S_TIME"
31 May 2022  23:06:35

. 
. ***--------------------------***
. // # PROGRAM SETUP
. ***--------------------------***
. 
. version 16 // keeps program consistent for future replications

. set linesize 80

. clear all

. set more off

. set seed 1

. 
. ***--------------------------***
. // # CREATE CPS-ASEC STATE SELECTIONS
. ***--------------------------***
. 
. use $deriv/redi01_ASEC-hhincome_all.dta, clear
(CPS ASEC data - Household Income - 2019)

. keep if year == 2019
(0 observations deleted)

. drop serial 

. label data "Streamlined CPS ASEC data, 2019"

. save $temp/redi14_cps_state_example.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_exampl
> e.dta saved

. 
. keep if statefip == 6 // California
(62,085 observations deleted)

. label data "Streamlined CPS ASEC data, CA 2019"

. save $temp/redi14_cps_state_ca.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_ca.dta
>  saved

. 
. use $temp/redi14_cps_state_example.dta, clear
(Streamlined CPS ASEC data, 2019)

. keep if statefip == 56 // Wyoming
(67,426 observations deleted)

. label data "Streamlined CPS ASEC data, WY 2019"

. save $temp/redi14_cps_state_wy.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_cps_state_wy.dta
>  saved

. 
. 
. ***--------------------------***
. // # PREP ACS RESEARCH DATASET
. ***--------------------------***
. 
. use $deriv/redi13_REDI_state_demvars.dta, clear
(ACS data with DEMOGRAPHIC VARIABLES)

. keep if year == 2019
(6,346,527 observations deleted)

. * Drop extraneous variables
. label data "Streamlined ACS data, 2019"

. datasignature set, reset 
  3239553:209(40251):1894994316:673242353       (data signature reset)

. 
. *arbitrary categories invented to demonstrate flexibility of method
. label define cat_inc                            ///
>         1       "Less than $15000"                              ///
>         2       "15000 to less than 25000"              ///
>         3       "25000 to less than 35000"              ///
>         4       "35000 to less than 50000"              ///
>         5       "50000 to less than 75000"              ///
>         6       "75000 to less than 100000"     ///
>         7       "100000 to less than 150000"    ///
>         8       "150000 to less than 200000"    ///
>         9       "200000 or more"                                //

.         
. gen     acs_hhinc = .
(3,239,553 missing values generated)

. replace acs_hhinc = 1 if acs_hinc_cont                                        
>      <= 15000
(190,626 real changes made)

. replace acs_hhinc = 2 if acs_hinc_cont  > 15000         & acs_hinc_cont <= 250
> 00
(182,072 real changes made)

. replace acs_hhinc = 3 if acs_hinc_cont  > 25000         & acs_hinc_cont <= 350
> 00
(205,123 real changes made)

. replace acs_hhinc = 4 if acs_hinc_cont  > 35000         & acs_hinc_cont <= 500
> 00        
(332,557 real changes made)

. replace acs_hhinc = 5 if acs_hinc_cont  > 50000         & acs_hinc_cont <= 750
> 00        
(522,013 real changes made)

. replace acs_hhinc = 6 if acs_hinc_cont  > 75000         & acs_hinc_cont <= 100
> 000
(444,753 real changes made)

. replace acs_hhinc = 7 if acs_hinc_cont  > 100000        & acs_hinc_cont <= 150
> 000 
(574,195 real changes made)

. replace acs_hhinc = 8 if acs_hinc_cont  > 150000        & acs_hinc_cont <= 200
> 000
(280,282 real changes made)

. replace acs_hhinc = 9 if acs_hinc_cont  > 200000        & acs_hinc_cont != 999
> 9999 
(356,611 real changes made)

. replace acs_hhinc = . if acs_hinc_cont == 9999999 
(0 real changes made)

. replace acs_hhinc = . if acs_hinc_cont == .
(0 real changes made)

. 
. label values acs_hhinc cat_inc

. label var acs_hhinc "Household Income (ACS) arbitrary categories based on acs_
> hinc_cont"

. notes acs_hhinc: ACS Household Income Categories from acs_hinc_cont \ $S_DATE

. 
. tab acs_hhinc, m

    Household Income (ACS) |
arbitrary categories based |
          on acs_hinc_cont |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
          Less than $15000 |    190,626        5.88        5.88
  15000 to less than 25000 |    182,072        5.62       11.50
  25000 to less than 35000 |    205,123        6.33       17.84
  35000 to less than 50000 |    332,557       10.27       28.10
  50000 to less than 75000 |    522,013       16.11       44.22
 75000 to less than 100000 |    444,753       13.73       57.94
100000 to less than 150000 |    574,195       17.72       75.67
150000 to less than 200000 |    280,282        8.65       84.32
            200000 or more |    356,611       11.01       95.33
                         . |    151,321        4.67      100.00
---------------------------+-----------------------------------
                     Total |  3,239,553      100.00

. *tab acs_hhinc, m nolab
. 
. replace acs_hinc_cont = . if acs_hinc_cont == . | acs_hinc_cont == 9999999 
(151,321 real changes made, 151,321 to missing)

. 
. save $temp/redi14_ACS2019.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_ACS2019.dta save
> d

. 
. ***--------------------------***
. // # CREATE ACS STATE SELECTIONS
. ***--------------------------***
. 
. use $temp/redi14_ACS2019.dta, clear
(Streamlined ACS data, 2019)

. keep if statefip == 6 // California
(2,859,462 observations deleted)

. label data "ACS data with artificial bins, CA 2019"

. save $temp/redi14_ACS2019CA.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_ACS2019CA.dta sa
> ved

. 
. use $temp/redi14_ACS2019.dta, clear
(Streamlined ACS data, 2019)

. keep if statefip == 56 // Wyoming
(3,233,586 observations deleted)

. label data "ACS data with artificial bins, WY 2019"

. save $temp/redi14_ACS2019WY.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_temp/redi14_ACS2019WY.dta sa
> ved

. 
. 
. ***--------------------------***
. // # COMPLETE REDI CONVERSIONS ON 2019 Wyoming  DATA
. ***--------------------------***
. // SAVE correct dataset for redi.ado use
. * cps_reference "$temp/redi14_cps_state_wy"
. use $temp/redi14_cps_state_wy.dta, clear
(Streamlined CPS ASEC data, WY 2019)

. save $redi/redi_package/cps_reference.dta, replace
file ~/Documents/SocResearch/redi/redi_code/redi_package/cps_reference.dta saved

. 
. *year of conversion factor
. local year "year"

. 
. use $temp/redi14_ACS2019WY.dta, clear
(ACS data with artificial bins, WY 2019)

. keep if year == 2019
(0 observations deleted)

. 
. // Income Conversions
. rename acs_hhinc acs_hinc_shp

. cd "~/Documents/SocResearch/redi/redi_code/redi_package/" // location of redi 
> ado file
/Users/mmking/Documents/SocResearch/redi/redi_code/redi_package

. redi acs_hinc_shp year, ///
>         generate(redi_hinc) cpstype(household)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000001 saved
(Streamlined CPS ASEC data, WY 2019)
(0 observations deleted)
  variable county was long now byte
  (2,757 bytes saved)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000002 saved
Income type set as household income; Calculating household income using hhincome
>  CPS-ASEC variable.
Inflation year is 
(ACS data with artificial bins, WY 2019)
acs_hinc_shp: 186 missing values recoded
1 2 3 4 5 6 7 8 9 98
The income levels are: 1 2 3 4 5 6 7 8 9 98
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000003 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000003 saved
2019
Create local variable years to loop within that income level - values:2019
(ACS data with artificial bins, WY 2019)
(5,640 observations deleted)
The current inc_level is: 1
The inc_level 1 is at the lowest end of the original Research dataset income ran
> ge
inc_decoded: characters L e s space t h a n $ removed; acs_hinc_shp_ub generated
>  as int
Lower bound of -100,000 created for inc_level 1
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000004 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000004 saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, WY 2019)
Reference data open - Income type set as household income
(845 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000005 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000005 saved
Keep income between $-100000 and $15000 for 2019 year for ASEC.
number of observations (_N) was 0, now 327

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               327  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000005 saved
Completed random draw of 74 incomes from ASEC between $ -100000 and $15000 (inc 
> level 1 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               327  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 1 ($-100000-1500
> 0) and year 2019.
(327 missing values generated)
(327 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000006 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000006 saved
Saved REDI data (with continuous data) for inc_level 1 ($-100000-15000) and year
>  2019 in file
(ACS data with artificial bins, WY 2019)
(5,625 observations deleted)
The current inc_level is: 2
The inc_level 2 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as int
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 2 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000007 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000007 saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, WY 2019)
Reference data open - Income type set as household income
(840 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000008 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000008 saved
Keep income between $15000 and $25000 for 2019 year for ASEC.
number of observations (_N) was 0, now 342

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               342  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000008 saved
Completed random draw of 79 incomes from ASEC between $ 15000 and $25000 (inc le
> vel 2 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               342  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 2 ($15000-25000)
>  and year 2019.
(342 missing values generated)
(342 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000009 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000009 saved
Saved REDI data (with continuous data) for inc_level 2 ($15000-25000) and year 2
> 019 in file
(ACS data with artificial bins, WY 2019)
(5,597 observations deleted)
The current inc_level is: 3
The inc_level 3 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 3 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000a not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000a saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, WY 2019)
Reference data open - Income type set as household income
(829 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000b not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000b saved
Keep income between $25000 and $35000 for 2019 year for ASEC.
number of observations (_N) was 0, now 370

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               370  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000b saved
Completed random draw of 90 incomes from ASEC between $ 25000 and $35000 (inc le
> vel 3 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               370  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 3 ($25000-35000)
>  and year 2019.
(370 missing values generated)
(370 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000c not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000c saved
Saved REDI data (with continuous data) for inc_level 3 ($25000-35000) and year 2
> 019 in file
(ACS data with artificial bins, WY 2019)
(5,343 observations deleted)
The current inc_level is: 4
The inc_level 4 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 4 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000d not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000d saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, WY 2019)
Reference data open - Income type set as household income
(808 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000e not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000e saved
Keep income between $35000 and $50000 for 2019 year for ASEC.
number of observations (_N) was 0, now 624

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               624  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000e saved
Completed random draw of 111 incomes from ASEC between $ 35000 and $50000 (inc l
> evel 4 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               624  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 4 ($35000-50000)
>  and year 2019.
(624 missing values generated)
(624 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000f not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000f saved
Saved REDI data (with continuous data) for inc_level 4 ($35000-50000) and year 2
> 019 in file
(ACS data with artificial bins, WY 2019)
(4,839 observations deleted)
The current inc_level is: 5
The inc_level 5 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 5 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000g not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000g saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, WY 2019)
Reference data open - Income type set as household income
(742 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000h not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000h saved
Keep income between $50000 and $75000 for 2019 year for ASEC.
number of observations (_N) was 0, now 1,128

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,128  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000h saved
Completed random draw of 177 incomes from ASEC between $ 50000 and $75000 (inc l
> evel 5 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,128  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 5 ($50000-75000)
>  and year 2019.
(1,128 missing values generated)
(1,128 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000i not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000i saved
Saved REDI data (with continuous data) for inc_level 5 ($50000-75000) and year 2
> 019 in file
(ACS data with artificial bins, WY 2019)
(4,931 observations deleted)
The current inc_level is: 6
The inc_level 6 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 6 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000j not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000j saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, WY 2019)
Reference data open - Income type set as household income
(796 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000k not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000k saved
Keep income between $75000 and $100000 for 2019 year for ASEC.
number of observations (_N) was 0, now 1,036

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,036  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000k saved
Completed random draw of 123 incomes from ASEC between $ 75000 and $100000 (inc 
> level 6 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,036  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 6 ($75000-100000
> ) and year 2019.
(1,036 missing values generated)
(1,036 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000l not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000l saved
Saved REDI data (with continuous data) for inc_level 6 ($75000-100000) and year 
> 2019 in file
(ACS data with artificial bins, WY 2019)
(4,829 observations deleted)
The current inc_level is: 7
The inc_level 7 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 7 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000m not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000m saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, WY 2019)
Reference data open - Income type set as household income
(756 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000n not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000n saved
Keep income between $100000 and $150000 for 2019 year for ASEC.
number of observations (_N) was 0, now 1,138

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,138  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000n saved
Completed random draw of 163 incomes from ASEC between $ 100000 and $150000 (inc
>  level 7 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,138  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 7 ($100000-15000
> 0) and year 2019.
(1,138 missing values generated)
(1,138 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000o not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000o saved
Saved REDI data (with continuous data) for inc_level 7 ($100000-150000) and year
>  2019 in file
(ACS data with artificial bins, WY 2019)
(5,496 observations deleted)
The current inc_level is: 8
The inc_level 8 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 8 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000p not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000p saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, WY 2019)
Reference data open - Income type set as household income
(857 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000q not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000q saved
Keep income between $150000 and $200000 for 2019 year for ASEC.
number of observations (_N) was 0, now 471

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               471  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000q saved
Completed random draw of 62 incomes from ASEC between $ 150000 and $200000 (inc 
> level 8 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               471  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 8 ($150000-20000
> 0) and year 2019.
(471 missing values generated)
(471 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000r not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000r saved
Saved REDI data (with continuous data) for inc_level 8 ($150000-200000) and year
>  2019 in file
(ACS data with artificial bins, WY 2019)
(5,622 observations deleted)
The current inc_level is: 9
The inc_level 9 is at the highest end of the original Research dataset income ra
> nge
inc_decoded: characters space o e r m removed; acs_hinc_shp_lb generated as long
Upper bound of 999999 created for inc_level 9
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000s not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000s saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, WY 2019)
Reference data open - Income type set as household income
(869 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000t not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000t saved
Keep income between $200000 and $999999 for 2019 year for ASEC.
number of observations (_N) was 0, now 345

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               345  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000t saved
Completed random draw of 50 incomes from ASEC between $ 200000 and $999999 (inc 
> level 9 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               345  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 9 ($200000-99999
> 9) and year 2019.
(345 missing values generated)
(345 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000u not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000u saved
Saved REDI data (with continuous data) for inc_level 9 ($200000-999999) and year
>  2019 in file
(ACS data with artificial bins, WY 2019)
(5,781 observations deleted)
The current inc_level is: 98
The inc_level 98 is missing (recoded as 98)
(186 missing values generated)
(186 missing values generated)
Lower and upper bound of . created for inc_level 98
(186 missing values generated)
(186 missing values generated)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000v not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000v saved
Saved REDI data (with continuous data) for the missing inc_level for year 2019 i
> n file
(note: variable acs_hinc_shp_ub was int, now float to accommodate using data's
       values)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(note: variable acs_hinc_shp_lb was float, now double to accommodate using
       data's values)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label union_lbl already defined)
(label health_lbl already defined)
(label migrate1_lbl already defined)
(label whymove_lbl already defined)
(label diffmob_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label hispan_lbl already defined)
(label nchild_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label sex_lbl already defined)
(label age_lbl already defined)
(label ownershp_lbl already defined)
(label statefip_lbl already defined)
(label asecflag_lbl already defined)
(label month_lbl already defined)
(label cat_inc already defined)
(label diffmob_lbl already defined)
(label migrate1d_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educd_lbl already defined)
(label educ_lbl already defined)
(label hispand_lbl already defined)
(label hispan_lbl already defined)
(label raced_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label ownershp_lbl already defined)
(label gq_lbl already defined)
(label statefip_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000w not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000w saved
Saved new tempfile for year 2019 for all REDI  income levels.
Appended all years
(186 missing values generated)
acs_hinc_shp: 186 missing values generated

. 
. // Clean Up
. drop gq sample serial cbserial countyfip

. svyset[pweight=perwt], vce(brr) brrweight(repwtp1-repwtp80) fay(.5)mse

      pweight: perwt
          VCE: brr
          MSE: on
    brrweight: repwtp1 .. repwtp80
          fay: .5
  Single unit: missing
     Strata 1: <one>
         SU 1: <observations>
        FPC 1: <zero>

. 
. rename acs_hinc_shp acs_hinc

. order acs_hinc redi_hinc acs_hinc_cont acs_hinc_shp_lb acs_hinc_shp_ub 

. 
. // CREATE NATURAL LOG INCOME VARIABLES
. gen redi_hinc_ln = ln(redi_hinc)
(213 missing values generated)

. replace redi_hinc_ln = 0 if redi_hinc <= 0
(27 real changes made)

. 
. gen acs_hinc_ln = ln(acs_hinc_cont)
(216 missing values generated)

. replace acs_hinc_ln = 0 if acs_hinc_cont <= 0
(30 real changes made)

. 
. // Save Data 
. label data "Wyoming 2019 ACS data converted to continuous REDI-calculated valu
> es"

. notes: redi14_REDI_Wy2019.dta \ ///
>         ACS hinc_shp Data converted to continuous REDI \ /// 
>         redi14_REDI_state_dataprep.do  $S_DATE

. 
. compress
  variable acs_hinc was float now byte
  variable dB_fem was float now byte
  variable hisp was float now byte
  variable dB_rwhite was float now byte
  variable dB_rblack was float now byte
  variable dB_rasian was float now byte
  variable dB_rhisp was float now byte
  variable dB_rother was float now byte
  variable dG_race was float now byte
  variable dG_edu was float now byte
  variable dB_edu_lHS was float now byte
  variable dB_edu_HS was float now byte
  variable dB_edu_sCol was float now byte
  variable dB_edu_col was float now byte
  variable dB_edu_grad was float now byte
  variable dB_edu_colp was float now byte
  variable disability was float now byte
  variable married was float now byte
  variable ownhouse was float now byte
  variable migrate was float now byte
  variable acs_hinc_shp_lb was double now long
  (381,888 bytes saved)

. datasignature set, reset  
  5967:231(19791):1038390742:3618506813       (data signature reset)

. save $deriv/redi14_REDI_Wy2019.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_derv/redi14_REDI_Wy2019.dta 
> saved

. 
. di in red "Completed REDI conversions for Wyoming 2019 data" 
Completed REDI conversions for Wyoming 2019 data

. 
. 
. ***--------------------------***
. // # COMPLETE REDI CONVERSIONS ON 2019 California  DATA
. ***--------------------------***
. * change line redi.ado to "use $temp/redi14_cps_state_ca.dta, clear"
. // SAVE correct dataset for redi.ado use
. * cps_reference "$temp/redi14_cps_state_ca"
. use $temp/redi14_cps_state_ca.dta, clear
(Streamlined CPS ASEC data, CA 2019)

. save $redi/redi_package/cps_reference.dta, replace
file ~/Documents/SocResearch/redi/redi_code/redi_package/cps_reference.dta saved

. 
. *year of conversion factor
. local year "year"

. 
. use $temp/redi14_ACS2019CA.dta, clear
(ACS data with artificial bins, CA 2019)

. keep if year == 2019
(0 observations deleted)

. 
. // Income Conversions
. rename acs_hhinc acs_hinc_shp

. cd "~/Documents/SocResearch/redi/redi_code/redi_package/" // location of redi 
> ado file
/Users/mmking/Documents/SocResearch/redi/redi_code/redi_package

. redi acs_hinc_shp year, ///
>         generate(redi_hinc) cpstype(household)  
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000001 saved
(Streamlined CPS ASEC data, CA 2019)
(0 observations deleted)
  variable county was long now int
  (12,520 bytes saved)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000002 saved
Income type set as household income; Calculating household income using hhincome
>  CPS-ASEC variable.
Inflation year is 
(ACS data with artificial bins, CA 2019)
acs_hinc_shp: 16092 missing values recoded
1 2 3 4 5 6 7 8 9 98
The income levels are: 1 2 3 4 5 6 7 8 9 98
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000003 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000003 saved
2019
Create local variable years to loop within that income level - values:2019
(ACS data with artificial bins, CA 2019)
(362,110 observations deleted)
The current inc_level is: 1
The inc_level 1 is at the lowest end of the original Research dataset income ran
> ge
inc_decoded: characters L e s space t h a n $ removed; acs_hinc_shp_ub generated
>  as int
Lower bound of -100,000 created for inc_level 1
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000004 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000004 saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, CA 2019)
Reference data open - Income type set as household income
(5,679 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000005 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000005 saved
Keep income between $-100000 and $15000 for 2019 year for ASEC.
number of observations (_N) was 0, now 17,981

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,981  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000005 saved
Completed random draw of 581 incomes from ASEC between $ -100000 and $15000 (inc
>  level 1 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,981  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 1 ($-100000-1500
> 0) and year 2019.
(17,981 missing values generated)
(17,981 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000006 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000006 saved
Saved REDI data (with continuous data) for inc_level 1 ($-100000-15000) and year
>  2019 in file
(ACS data with artificial bins, CA 2019)
(362,779 observations deleted)
The current inc_level is: 2
The inc_level 2 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as int
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 2 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000007 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000007 saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, CA 2019)
Reference data open - Income type set as household income
(5,775 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000008 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000008 saved
Keep income between $15000 and $25000 for 2019 year for ASEC.
number of observations (_N) was 0, now 17,312

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,312  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000008 saved
Completed random draw of 485 incomes from ASEC between $ 15000 and $25000 (inc l
> evel 2 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            17,312  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 2 ($15000-25000)
>  and year 2019.
(17,312 missing values generated)
(17,312 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000009 not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.000009 saved
Saved REDI data (with continuous data) for inc_level 2 ($15000-25000) and year 2
> 019 in file
(ACS data with artificial bins, CA 2019)
(360,497 observations deleted)
The current inc_level is: 3
The inc_level 3 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as int
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 3 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000a not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000a saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, CA 2019)
Reference data open - Income type set as household income
(5,714 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000b not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000b saved
Keep income between $25000 and $35000 for 2019 year for ASEC.
number of observations (_N) was 0, now 19,594

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            19,594  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000b saved
Completed random draw of 546 incomes from ASEC between $ 25000 and $35000 (inc l
> evel 3 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            19,594  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 3 ($25000-35000)
>  and year 2019.
(19,594 missing values generated)
(19,594 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000c not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000c saved
Saved REDI data (with continuous data) for inc_level 3 ($25000-35000) and year 2
> 019 in file
(ACS data with artificial bins, CA 2019)
(347,770 observations deleted)
The current inc_level is: 4
The inc_level 4 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 4 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000d not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000d saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, CA 2019)
Reference data open - Income type set as household income
(5,519 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000e not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000e saved
Keep income between $35000 and $50000 for 2019 year for ASEC.
number of observations (_N) was 0, now 32,321

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            32,321  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000e saved
Completed random draw of 741 incomes from ASEC between $ 35000 and $50000 (inc l
> evel 4 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            32,321  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 4 ($35000-50000)
>  and year 2019.
(32,321 missing values generated)
(32,321 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000f not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000f saved
Saved REDI data (with continuous data) for inc_level 4 ($35000-50000) and year 2
> 019 in file
(ACS data with artificial bins, CA 2019)
(328,388 observations deleted)
The current inc_level is: 5
The inc_level 5 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 5 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000g not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000g saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, CA 2019)
Reference data open - Income type set as household income
(5,240 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000h not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000h saved
Keep income between $50000 and $75000 for 2019 year for ASEC.
number of observations (_N) was 0, now 51,703

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            51,703  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000h saved
Completed random draw of 1020 incomes from ASEC between $ 50000 and $75000 (inc 
> level 5 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            51,703  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 5 ($50000-75000)
>  and year 2019.
(51,703 missing values generated)
(51,703 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000i not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000i saved
Saved REDI data (with continuous data) for inc_level 5 ($50000-75000) and year 2
> 019 in file
(ACS data with artificial bins, CA 2019)
(331,796 observations deleted)
The current inc_level is: 6
The inc_level 6 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 6 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000j not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000j saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, CA 2019)
Reference data open - Income type set as household income
(5,434 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000k not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000k saved
Keep income between $75000 and $100000 for 2019 year for ASEC.
number of observations (_N) was 0, now 48,295

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            48,295  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000k saved
Completed random draw of 826 incomes from ASEC between $ 75000 and $100000 (inc 
> level 6 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            48,295  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 6 ($75000-100000
> ) and year 2019.
(48,295 missing values generated)
(48,295 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000l not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000l saved
Saved REDI data (with continuous data) for inc_level 6 ($75000-100000) and year 
> 2019 in file
(ACS data with artificial bins, CA 2019)
(309,228 observations deleted)
The current inc_level is: 7
The inc_level 7 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 7 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000m not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000m saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, CA 2019)
Reference data open - Income type set as household income
(5,295 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000n not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000n saved
Keep income between $100000 and $150000 for 2019 year for ASEC.
number of observations (_N) was 0, now 70,863

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            70,863  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000n saved
Completed random draw of 965 incomes from ASEC between $ 100000 and $150000 (inc
>  level 7 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            70,863  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 7 ($100000-15000
> 0) and year 2019.
(70,863 missing values generated)
(70,863 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000o not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000o saved
Saved REDI data (with continuous data) for inc_level 7 ($100000-150000) and year
>  2019 in file
(ACS data with artificial bins, CA 2019)
(338,355 observations deleted)
The current inc_level is: 8
The inc_level 8 has a lower and an upper level
variables born as string: 
inc_decoded1  inc_decoded2
inc_decoded1: character space removed; replaced as long
inc_decoded2: character space removed; replaced as long
Lower bound of acs_hinc_shp_lb and upper bound of acs_hinc_shp_ub created for in
> c_level 8 of the original Research dataset income range
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000p not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000p saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, CA 2019)
Reference data open - Income type set as household income
(5,769 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000q not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000q saved
Keep income between $150000 and $200000 for 2019 year for ASEC.
number of observations (_N) was 0, now 41,736

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            41,736  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000q saved
Completed random draw of 491 incomes from ASEC between $ 150000 and $200000 (inc
>  level 8 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            41,736  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 8 ($150000-20000
> 0) and year 2019.
(41,736 missing values generated)
(41,736 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000r not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000r saved
Saved REDI data (with continuous data) for inc_level 8 ($150000-200000) and year
>  2019 in file
(ACS data with artificial bins, CA 2019)
(315,897 observations deleted)
The current inc_level is: 9
The inc_level 9 is at the highest end of the original Research dataset income ra
> nge
inc_decoded: characters space o e r m removed; acs_hinc_shp_lb generated as long
Upper bound of 999999 created for inc_level 9
(0 observations deleted)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000s not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000s saved
Saved tempfile with upper and lower bounds of research data income levels
(Streamlined CPS ASEC data, CA 2019)
Reference data open - Income type set as household income
(5,528 observations deleted)
Observation number generated
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000t not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000t saved
Keep income between $200000 and $999999 for 2019 year for ASEC.
number of observations (_N) was 0, now 64,194

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            64,194  
    -----------------------------------------
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000t saved
Completed random draw of 732 incomes from ASEC between $ 200000 and $999999 (inc
>  level 9 )
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label sex_lbl already defined)
(label marst_lbl already defined)
(label race_lbl already defined)
(label hispan_lbl already defined)
(label educ_lbl already defined)
(label labforce_lbl already defined)
(label migrate1_lbl already defined)
(label diffmob_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            64,194  (_merge==3)
    -----------------------------------------
Merged ASEC values with original Research dataset for inc_level 9 ($200000-99999
> 9) and year 2019.
(64,194 missing values generated)
(64,194 real changes made)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000u not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000u saved
Saved REDI data (with continuous data) for inc_level 9 ($200000-999999) and year
>  2019 in file
(ACS data with artificial bins, CA 2019)
(363,999 observations deleted)
The current inc_level is: 98
The inc_level 98 is missing (recoded as 98)
(16,092 missing values generated)
(16,092 missing values generated)
Lower and upper bound of . created for inc_level 98
(16,092 missing values generated)
(16,092 missing values generated)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000v not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000v saved
Saved REDI data (with continuous data) for the missing inc_level for year 2019 i
> n file
(note: variable acs_hinc_shp_ub was int, now float to accommodate using data's
       values)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(note: variable acs_hinc_shp_lb was float, now double to accommodate using
       data's values)
(label _merge already defined)
(label cat_inc already defined)
(label migrate1d_lbl already defined)
(label educd_lbl already defined)
(label hispand_lbl already defined)
(label raced_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label gq_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(label month_lbl already defined)
(label asecflag_lbl already defined)
(label statefip_lbl already defined)
(label ownershp_lbl already defined)
(label age_lbl already defined)
(label sex_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label nchild_lbl already defined)
(label hispan_lbl already defined)
(label labforce_lbl already defined)
(label educ_lbl already defined)
(label diffmob_lbl already defined)
(label whymove_lbl already defined)
(label migrate1_lbl already defined)
(label health_lbl already defined)
(label union_lbl already defined)
(label cat_inc already defined)
(label diffmob_lbl already defined)
(label migrate1d_lbl already defined)
(label migrate1_lbl already defined)
(label labforce_lbl already defined)
(label educd_lbl already defined)
(label educ_lbl already defined)
(label hispand_lbl already defined)
(label hispan_lbl already defined)
(label raced_lbl already defined)
(label race_lbl already defined)
(label marst_lbl already defined)
(label sex_lbl already defined)
(label repwtp_lbl already defined)
(label ownershpd_lbl already defined)
(label ownershp_lbl already defined)
(label gq_lbl already defined)
(label statefip_lbl already defined)
(label repwt_lbl already defined)
(label sample_lbl already defined)
(label dB_fem already defined)
(label dB_rwhite already defined)
(label dB_rblack already defined)
(label dB_rasian already defined)
(label dB_rhisp already defined)
(label dB_rother already defined)
(label race_5categ already defined)
(label edu_5categ already defined)
(label dB_edu_lHS already defined)
(label dB_edu_HS already defined)
(label dB_edu_sCol already defined)
(label dB_edu_col already defined)
(label dB_edu_grad already defined)
(label dB_edu_colp already defined)
(note: file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000w not
>  found)
file /var/folders/p5/4pbm3kvx22d9qc1mqdft2symrmksfh/T//S_06967.00000w saved
Saved new tempfile for year 2019 for all REDI  income levels.
Appended all years
(16,092 missing values generated)
acs_hinc_shp: 16092 missing values generated

. 
. // Clean Up
. drop gq sample serial cbserial countyfip

. svyset[pweight=perwt], vce(brr) brrweight(repwtp1-repwtp80) fay(.5)mse

      pweight: perwt
          VCE: brr
          MSE: on
    brrweight: repwtp1 .. repwtp80
          fay: .5
  Single unit: missing
     Strata 1: <one>
         SU 1: <observations>
        FPC 1: <zero>

. 
. rename acs_hinc_shp acs_hinc

. order acs_hinc redi_hinc acs_hinc_cont acs_hinc_shp_lb acs_hinc_shp_ub 

. 
. // CREATE NATURAL LOG INCOME VARIABLES
. gen redi_hinc_ln = ln(redi_hinc)
(18,793 missing values generated)

. replace redi_hinc_ln = 0 if redi_hinc <= 0
(2,701 real changes made)

. 
. gen acs_hinc_ln = ln(acs_hinc_cont)
(18,634 missing values generated)

. replace acs_hinc_ln = 0 if acs_hinc_cont <= 0
(2,542 real changes made)

. 
. // Save Data 
. label data "California 2019 ACS data converted to continuous REDI-calculated v
> alues"

. notes: redi14_REDI_Ca2019.dta \ ///
>         ACS hinc_shp Data converted to continuous REDI \ /// 
>         redi14_REDI_state_example.do  $S_DATE

. compress
  variable acs_hinc was float now byte
  variable dB_fem was float now byte
  variable hisp was float now byte
  variable dB_rwhite was float now byte
  variable dB_rblack was float now byte
  variable dB_rasian was float now byte
  variable dB_rhisp was float now byte
  variable dB_rother was float now byte
  variable dG_race was float now byte
  variable dG_edu was float now byte
  variable dB_edu_lHS was float now byte
  variable dB_edu_HS was float now byte
  variable dB_edu_sCol was float now byte
  variable dB_edu_col was float now byte
  variable dB_edu_grad was float now byte
  variable dB_edu_colp was float now byte
  variable disability was float now byte
  variable married was float now byte
  variable ownhouse was float now byte
  variable migrate was float now byte
  variable acs_hinc_shp_lb was double now long
  (24,325,824 bytes saved)

. datasignature set, reset  
  380091:231(19791):3111982676:284659018       (data signature reset)

. save $deriv/redi14_REDI_Ca2019.dta, replace
file ~/Documents/SocResearch/Dissertation/data/data_derv/redi14_REDI_Ca2019.dta 
> saved

. 
. di in red "Completed REDI conversions for California 2019 data" 
Completed REDI conversions for California 2019 data

. 
. 
. ***--------------------------***
. 
. capture log close redi14_REDI_state_dataprep
